Repository: igorrocha/django-tutorial
Catalog: locale/*/LC_MESSAGES/intro.po
Languages: es

source: Next we'll be adding the functionality described in ticket :ticket:`17549` to Django.
es: A continuación vamos a agregar a Django la funcionalidad descripta en el :ticket:`17549`.

source: Writing the code for ticket #17549
es: Escribir el código para el ticket #17549

source: Navigate to the ``django/django/contrib/admin/`` folder and open the ``widgets.py`` file. Find the ``AdminURLFieldWidget`` class on line 302 and add the following ``render`` method after the existing ``__init__`` method::
es: Navegamos al directorio ``django/django/contrib/admin/`` y abrimos el archivo ``widgets.py``. Buscamos la clase ``AdminURLFieldWidget`` en la línea 302 y agregamos el siguiente método ``render`` después del método ``__init__`` ya existente::

source: Verifying your test now passes
es: Verificar que los tests pasan

source: Once you're done modifying Django, we need to make sure that the tests we wrote earlier pass, so we can see whether the code we wrote above is working correctly. To run the tests in the ``admin_widgets`` folder, ``cd`` into the Django ``tests/`` directory and run::
es: Una vez que terminamos las modificaciones, necesitamos verificar que los tests que escribimos anteriormente pasan, para saber si el código que acabamos de escribir funciona correctamente. Para correr los tests en el directorio ``admin_widgets``, hacemos ``cd`` al directorio ``tests/`` de Django y corremos::

source: Oops, good thing we wrote those tests! You should still see 3 failures with the following exception::
es: Oops, menos mal que escribimos esos tests! Todavía deberíamos ver las 3 fallas, con la siguiente excepción::

source: We forgot to add the import for that method. Go ahead and add the ``smart_urlquote`` import at the end of line 13 of ``django/contrib/admin/widgets.py`` so it looks as follows::
es: Nos olvidamos de agregar el import para ese método. Agregamos el import de ``smart_urlquote`` al final de la línea 13 de ``django/contrib/admin/widgets.py`` para que se vea así::

source: Re-run the tests and everything should pass. If it doesn't, make sure you correctly modified the ``AdminURLFieldWidget`` class as shown above and copied the new tests correctly.
es: Volvemos a correr los tests y todos deberían pasar. Si no, asegurarse de que se modificó correctamente la clase ``AdminURLFieldWidget`` como se mostró arriba y que los tests también se copiaron correctamente.

source: Running Django's test suite for the second time
es: Corriendo la test suite de Django por segunda vez

source: Once you've verified that your patch and your test are working correctly, it's a good idea to run the entire Django test suite just to verify that your change hasn't introduced any bugs into other areas of Django. While successfully passing the entire test suite doesn't guarantee your code is bug free, it does help identify many bugs and regressions that might otherwise go unnoticed.
es: Una vez que verificamos que nuestro patch y nuestros tests funcionan correctamente, es una buena idea correr la test suite de Django entera para confirmar que nuestro cambio no introdujo ningún bug en otras áreas de Django. Si bien el que la test suite pase no garantiza que nuestro código esté libre de bugs, ayuda a identificar muchos bugs y regresiones que de otra manera podrían pasar desapercibidos.

source: To run the entire Django test suite, ``cd`` into the Django ``tests/`` directory and run::
es: Para correr la test suite de Django completa, ``cd`` al directorio ``tests/`` y corremos::

source: As long as you don't see any failures, you're good to go. Note that this fix also made a `small CSS change`__ to format the new widget. You can make the change if you'd like, but we'll skip it for now in the interest of brevity.
es: Mientras que no veamos ninguna falla, estamos bien. Notemos que en el fix original también se hace un `pequeño cambio de CSS`__ para formatear el widget. Podemos incluir este cambio también, pero lo salteamos por ahora por cuestiones de brevedad.

source: Writing Documentation
es: Escribir documentación

source: This is a new feature, so it should be documented. Add the following on line 925 of ``django/docs/ref/models/fields.txt`` beneath the existing docs for ``URLField``::
es: Esta es una nueva funcionalidad, así que debería documentarse. Agregamos lo siguiente desde la línea 925 de ``django/docs/ref/models/fields.txt`` junto a la documentación existente de ``URLField``::

source: For more information on writing documentation, including an explanation of what the ``versionadded`` bit is all about, see `/internals/contributing/writing-documentation <https://docs.djangoproject.com/en/1.8/internals/contributing/writing-documentation>`_. That page also includes an explanation of how to build a copy of the documentation locally, so you can preview the HTML that will be generated.
es: Para mayor información sobre escribir documentación, incluyendo una explicación de qué se trata esto de ``versionadded``, se puede consultar en `la sección correspondiente <https://docs.djangoproject.com/en/1.8/internals/contributing/writing-documentation>`_. Esa página también incluye una explicación de cómo generar una copia de la documentación localmente, para poder prever el HTML que se va a producir.

source: Generating a patch for your changes
es: Generar un patch con los cambios

source: Now it's time to generate a patch file that can be uploaded to Trac or applied to another copy of Django. To get a look at the content of your patch, run the following command::
es: Ahora es momento de generar un archivo de patch que se pueda subir al Trac o aplicarse a otra copia de Django. Para obtenere un vistazo del contenido de nuestro patch, corremos el siguiente comando::

source: This will display the differences between your current copy of Django (with your changes) and the revision that you initially checked out earlier in the tutorial.
es: Esto va a mostrar las diferencias entre nuestra copia actual de Django (con los cambios) y la revisión que teníamos inicialmente al principio del tutorial.

source: Once you're done looking at the patch, hit the ``q`` key to exit back to the command line. If the patch's content looked okay, you can run the following command to save the patch file to your current working directory::
es: Apretamos ``q`` para volver a la línea de comandos. Si el contenido del patch se veía bien, podemos correr el siguiente comando para guardar el archivo del patch en nuestro directorio actual::

source: You should now have a file in the root Django directory called ``17549.diff``. This patch file contains all your changes and should look this:
es: Deberíamos tener un archivo en el directorio raíz de Django llamando ``17549.diff``. Este archivo contiene nuestros cambios y debería verse algo así:

source: So what do I do next?
es: Qué hacemos ahora?

source: Congratulations, you've generated your very first Django patch! Now that you've got that under your belt, you can put those skills to good use by helping to improve Django's codebase. Generating patches and attaching them to Trac tickets is useful, however, since we are using git - adopting a more `git oriented workflow <https://docs.djangoproject.com/en/1.8/internals/contributing/writing-code/working-with-git>`_ is recommended.
es: Felicitaciones, hemos generado nuestro primer patch para Django! Ahora podemos usar estas habilidades para ayudar a mejorar el código de Django. Generar patches y adjuntarlos a tickets en el Trac es útil, pero, como ahora estamos usando git - se recomiendo adoptar un `workflow orientado a git <https://docs.djangoproject.com/en/1.8/internals/contributing/writing-code/working-with-git>`_.

source: Since we never committed our changes locally, perform the following to get your git branch back to a good starting point::
es: Como nunca commiteamos nuestros cambios localmente, hacemos lo siguiente para devolver nuestro branch a un buen punto de comienzo (reseteamos nuestros cambios)::

source: More information for new contributors
es: Más información para nuevos contribuidores

source: Before you get too into writing patches for Django, there's a little more information on contributing that you should probably take a look at:
es: Antes de ponerse de lleno a escribir patches para Django, hay más información sobre el tema que probablemente deberías leer:

source: You should make sure to read Django's documentation on `claiming tickets and submitting patches <https://docs.djangoproject.com/en/1.8/internals/contributing/writing-code/submitting-patches>`_. It covers Trac etiquette, how to claim tickets for yourself, expected coding style for patches, and many other important details.
es: Deberías asegurarte de leer la documentación de Django sobre `reclamando tickets y enviando patches <https://docs.djangoproject.com/en/1.8/internals/contributing/writing-code/submitting-patches>`_. Cubre la etiqueta en Trac, cómo reclamar tickets, el estilo de código esperado para un patch, y otros detalles importantes.

source: First time contributors should also read Django's `documentation for first time contributors <https://docs.djangoproject.com/en/1.8/internals/contributing/new-contributors/>`_. It has lots of good advice for those of us who are new to helping out with Django.
es: Aquellos que contribuyen por primera vez deberían leer también la `documentación para contribuidores por primera vez <https://docs.djangoproject.com/en/1.8/internals/contributing/new-contributors/>`_. Tiene muchos consejos para quienes son nuevos en esto de ayudar con Django.

source: After those, if you're still hungry for more information about contributing, you can always browse through the rest of `Django's documentation on contributing <https://docs.djangoproject.com/en/1.8/internals/contributing/index>`_. It contains a ton of useful information and should be your first source for answering any questions you might have.
es: Y si todavía buscás más información sobre contribuir, siempre se puede revisar el resto de la `documentación de Django sobre contribuir <https://docs.djangoproject.com/en/1.8/internals/contributing/index>`_. Contiene mucha información útil y debería ser el primer recurso en busca de respuestas a cualquier pregunta que te pudiera surgir.

source: Finding your first real ticket
es: Encontrar nuestro primer ticket de verdad

source: Once you've looked through some of that information, you'll be ready to go out and find a ticket of your own to write a patch for. Pay special attention to tickets with the "easy pickings" criterion. These tickets are often much simpler in nature and are great for first time contributors. Once you're familiar with contributing to Django, you can move on to writing patches for more difficult and complicated tickets.
es: Después de recorrer la información de arriba, estaremos listos para salir a buscar un ticket para el que podamos escribir un patch. Hay que prestar especial atención a los tickets marcados como "easy pickings". Estos tickets suelen ser más simples y son una gran oportunidad para aquellos que quieren contribuir por primera vez. Una vez que estemos familiarizados con el contribuir con Django, podemos pasar a escribir patches para tickets más complicados.

source: If you just want to get started already (and nobody would blame you!), try taking a look at the list of `easy tickets that need patches`__ and the `easy tickets that have patches which need improvement`__. If you're familiar with writing tests, you can also look at the list of `easy tickets that need tests`__. Just remember to follow the guidelines about claiming tickets that were mentioned in the link to Django's documentation on `claiming tickets and submitting patches <https://docs.djangoproject.com/en/1.8/internals/contributing/writing-code/submitting-patches>`_.
es: Si queremos empezar ya, se puede pegar una mirada a la lista de `tickets simples que necesitan patches`__ y la lista de `tickets simples que tienen patches que necesitan mejoras`__. Si estamos familiarizados con escribir tests, también podemos ver la lista de `tickets simples que necesitan tests`__. Recordar seguir las instrucciones sobre reclamar tickets mencionadas en el link a la documentación en `reclamando tickets y enviando patches <https://docs.djangoproject.com/en/1.8/internals/contributing/writing-code/submitting-patches>`_.

source: What's next?
es: Qué sigue?

source: After a ticket has a patch, it needs to be reviewed by a second set of eyes. After uploading a patch or submitting a pull request, be sure to update the ticket metadata by setting the flags on the ticket to say "has patch", "doesn't need tests", etc, so others can find it for review. Contributing doesn't necessarily always mean writing a patch from scratch. Reviewing existing patches is also a very helpful contribution. See `/internals/contributing/triaging-tickets <https://docs.djangoproject.com/en/1.8/internals/contributing/triaging-tickets>`_ for details.
es: Después que un ticket tiene un patch, se necesita que un segundo par de ojos lo revisen. Después de subir un patch o enviar un pull request, hay que asegurarse de actualizar la metadata del ticket, seteando los flags del ticket para que diga "has patch", "doesn't need tests", etc. para que otros lo puedan encontrar para revisarlo. Contribuir no necesariamente significa escribir un patch desde cero, revisar patches existentes es también una forma útil de ayudar. Para más detalles, ver `/internals/contributing/triaging-tickets <https://docs.djangoproject.com/en/1.8/internals/contributing/triaging-tickets>`_.

source: Getting started
es: Empezando con Django

source: New to Django? Or to Web development in general? Well, you came to the right place: read this material to quickly get up and running.
es: Nuevo en Django? O en desarrollo web en general? Bueno, estás en el lugar indicado: leé este material para empezar rápidamente.

source: If you're new to Python_, you might want to start by getting an idea of what the language is like. Django is 100% Python, so if you've got minimal comfort with Python you'll probably get a lot more out of Django.
es: Si sos nuevo en Python_, tal vez quieras empezar por hacerte una idea de cómo es este lenguaje. Django es 100% Python, entonces si uno tiene un mínimo comfort con Python probablemente puedas obtener mucho más de Django.

source: If you're new to programming entirely, you might want to start with this `list of Python resources for non-programmers`_
es: Si sos nuevo en lo que a programación se refiere, tal vez te convenga empezar con una leída a esta `lista de recursos sobre Python para no-programadores`_

source: If you already know a few other languages and want to get up to speed with Python quickly, we recommend `Dive Into Python`_. If that's not quite your style, there are many other `books about Python`_.
es: Si ya conocés otros lenguajes y querés empezar con Python rápidamente, recomendamos `Dive Into Python`_. Si este libro no sigue tu estilo, hay algunos otros `libros sobre Python`_.

source: Quick install guide
es: Guía de instalación rápida

source: Before you can use Django, you'll need to get it installed. We have a `complete installation guide <https://docs.djangoproject.com/en/1.8/topics/install>`_ that covers all the possibilities; this guide will guide you to a simple, minimal installation that'll work while you walk through the introduction.
es: Antes de poder usar Django es necesario instalarlo. Existe una `guía de instalación completa <https://docs.djangoproject.com/en/1.8/topics/install>`_ que cubre todas las posibilidades; esta guía es simple, cubre una instalación mínima que servirá mientras se recorre la introducción.

source: Install Python
es: Instalar Python

source: Being a Python Web framework, Django requires Python. It works with Python 2.7, 3.2, 3.3, or 3.4. All these versions of Python include a lightweight database called SQLite_ so you won't need to set up a database just yet.
es: Siendo un framework web escrito en Python, Django requiere Python. Funciona con Python 2.7, 3.2, 3.3, o 3.4. Estas versiones de Python incluyen una base de datos liviana llamada SQLite_, así que no es necesario configurar un motor de base datos inmediatamente.

source: Get the latest version of Python at https://www.python.org/download/ or with your operating system's package manager.
es: Para obtener la última versión de Python, ir a https://www.python.org/download/ o instalar a través del administrador de paquetes de tu sistema operativo.

source: Django on Jython
es: Django en Jython

source: If you use Jython_ (a Python implementation for the Java platform), you'll need to follow a few additional steps. See `/howto/jython <https://docs.djangoproject.com/en/1.8/howto/jython>`_ for details.
es: Si usás Jython_ (implementación de Python para la plataforma Java), es necesario seguir algunas pasos adicionales. Ver detalles en `/howto/jython <https://docs.djangoproject.com/en/1.8/howto/jython>`_.

source: You can verify that Python is installed by typing ``python`` from your shell; you should see something like::
es: Podés verificar que Python está instalado corriendo ``python`` en tu shell; deberías ver algo como::

source: Set up a database
es: Configurar una base de datos

source: This step is only necessary if you'd like to work with a "large" database engine like PostgreSQL, MySQL, or Oracle. To install such a database, consult the `database installation information <https://docs.djangoproject.com/en/1.8/topics/install/#database-installation>`_.
es: Este paso sólo es necesario si quisieras trabajar con un motor de base de datos más "grande" como PostgreSQL, MySQL u Oracle. Para ello consultá la `información sobre la instalación de base de datos <https://docs.djangoproject.com/en/1.8/topics/install/#database-installation>`_.

source: Remove any old versions of Django
es: Borrar versiones anteriores de Django

source: If you are upgrading your installation of Django from a previous version, you will need to `uninstall the old Django version before installing the new version <https://docs.djangoproject.com/en/1.8/topics/install/#removing-old-versions-of-django>`_.
es: Si estás actualizando una versión previa de Django es necesario `desinstalar la versión anterior antes de instalar una nueva <https://docs.djangoproject.com/en/1.8/topics/install/#removing-old-versions-of-django>`_.

source: Install Django
es: Instalar Django

source: You've got three easy options to install Django:
es: Existen tres opciones fáciles de instalar Django:

source: Install a version of Django `provided by your operating system distribution <https://docs.djangoproject.com/en/1.8/misc/distributions>`_. This is the quickest option for those who have operating systems that distribute Django.
es: Instalar una versión de Django `provista por tu sistema operativo <https://docs.djangoproject.com/en/1.8/misc/distributions>`_. Esta es la opción más rápida para aquellos que tienen un sistema operativo que distribuye Django.

source: `Install an official release <https://docs.djangoproject.com/en/1.8/topics/install/#installing-official-release>`_. This is the best approach for users who want a stable version number and aren't concerned about running a slightly older version of Django.
es: `Instalar un release oficial <https://docs.djangoproject.com/en/1.8/topics/install/#installing-official-release>`_. Esta es la mejor alternativa para los usuarios qie quieren un número de versión estable y que no les preocupa no correr la versión más reciente de Django.

source: `Install the latest development version <https://docs.djangoproject.com/en/1.8/topics/install/#installing-development-version>`_. This is best for users who want the latest-and-greatest features and aren't afraid of running brand-new code.
es: `Instalar la última versión de desarrollo <https://docs.djangoproject.com/en/1.8/topics/install/#installing-development-version>`_. Esta es la mejor opción para los usuarios que quieren las características más recientes y que no tienen miedo de correr código nuevo.

source: Always refer to the documentation that corresponds to the version of Django you're using!
es: Siempre recurrir a la versión de la documentación que corresponde a la versión de Django que estás usando!

source: If you do either of the first two steps, keep an eye out for parts of the documentation marked **new in development version**. That phrase flags features that are only available in development versions of Django, and they likely won't work with an official release.
es: Si seguís cualquiera de los dos primeros pasos, hay que estar atentos a las partes de la documentación marcadas como **new in development version** (nuevo en la versión de desarrollo). Esta frase indica características que están solamente disponibles en la versión de desarrollo de Django, y que muy posibiblemente no funcionen en un release oficial.

source: Verifying
es: Verificando

source: To verify that Django can be seen by Python, type ``python`` from your shell. Then at the Python prompt, try to import Django:
es: Para verificar que Django es accesible desde Python, tipeá ``python`` en tu shell. Una vez en el prompt de Python, intentá importar Django:

source: That's it!
es: Eso es todo!

source: That's it -- you can now :doc:`move onto the tutorial </intro/tutorial01>`.
es: Así es -- ahora podés :doc:`seguir con el tutorial </intro/tutorial01>`.

source: Django at a glance
es: Django de un vistazo

source: Because Django was developed in a fast-paced newsroom environment, it was designed to make common Web-development tasks fast and easy. Here's an informal overview of how to write a database-driven Web app with Django.
es: Como Django fue desarrollado en el entorno de una redacción de noticias, fue diseñado para hacer las tareas comunes del desarrollo web rápidas y fáciles. Esta es una introducción informal de cómo escribir una aplicación basada en una base de datos con Django.

source: The goal of this document is to give you enough technical specifics to understand how Django works, but this isn't intended to be a tutorial or reference -- but we've got both! When you're ready to start a project, you can :doc:`start with the tutorial </intro/tutorial01>` or `dive right into more detailed documentation <https://docs.djangoproject.com/en/1.8/topics/index>`_.
es: El objetivo de este documento es brindar las especificaciones técnicas suficientes para entender cómo funciona Django, pero no ser un tutorial o una referencia -- ambos existen! Cuando estés listo para empezar un proyecto, podés :doc:`chequear el tutorial </intro/tutorial01>` o sumergirte en la `documentación más detallada <https://docs.djangoproject.com/en/1.8/topics/index>`_.

source: Design your model
es: Diseñar tu modelo

source: Although you can use Django without a database, it comes with an `object-relational mapper`_ in which you describe your database layout in Python code.
es: Aunque se puede usar sin una base de datos, Django viene con un mapeador objeto-relacional a través del cual podés describir la estructura de tu base de datos en código Python.

source: The `data-model syntax <https://docs.djangoproject.com/en/1.8/topics/db/models>`_ offers many rich ways of representing your models -- so far, it's been solving many years' worth of database-schema problems. Here's a quick example:
es: La `sintaxis de modelo de datos <https://docs.djangoproject.com/en/1.8/topics/db/models>`_ ofrece muchas maneras de representar tus modelos -- al día de hoy ha resuelto problemas de esquema de base de datos por años. Aquí un rápido ejemplo:

source: Install it
es: Instalarlo
