Repository: igorrocha/django-tutorial
Catalog: locale/*/LC_MESSAGES/intro.po
Languages: es

source: Next, run the Django command-line utility to create the database tables automatically:
es: A continuación hay que correr la utilidad de línea de comandos de Django para crear las tablas de la base de datos automáticamente:

source: The :djadmin:`migrate` command looks at all your available models and creates tables in your database for whichever tables don't already exist, as well as optionally providing `much richer schema control <https://docs.djangoproject.com/en/1.8/topics/migrations>`_.
es: El comando :djadmin:`migrate` revisa todos los modelos disponibles y crea las tablas en la base de datos para aquellos que todavía no existan, como así también, opcionalmente, proveer `un amplio control sobre los esquemas <https://docs.djangoproject.com/en/1.8/topics/migrations>`_.

source: Enjoy the free API
es: Aprovecha la API ya provista

source: With that, you've got a free, and rich, `Python API <https://docs.djangoproject.com/en/1.8/topics/db/queries>`_ to access your data. The API is created on the fly, no code generation necessary:
es: En este punto ya obtenés una completa `API Python <https://docs.djangoproject.com/en/1.8/topics/db/queries>`_ para acceder a tus datos. La API es creada "al vuelo", sin requerir generación de código:

source: A dynamic admin interface: it's not just scaffolding -- it's the whole house
es: Interfaz de administración dinámica: no sólo los andamios -- la casa completa

source: Once your models are defined, Django can automatically create a professional, production ready `administrative interface <https://docs.djangoproject.com/en/1.8/ref/contrib/admin/index>`_ -- a Web site that lets authenticated users add, change and delete objects. It's as easy as registering your model in the admin site:
es: Una vez que tus modelos están definidos, Django puede crear automáticamente una `interfaz de administración <https://docs.djangoproject.com/en/1.8/ref/contrib/admin/index>`_ profesional, lista para producción -- un sitio web que permite a usuarios autenticados agregar, modificar y borrar objetos. Es tan fácil como registrar tu modelo en el sitio de administración:

source: The philosophy here is that your site is edited by a staff, or a client, or maybe just you -- and you don't want to have to deal with creating backend interfaces just to manage content.
es: La filosofía aquí es que tu sitio es editado por un staff, un cliente o quizás solamente vos -- y vos no querés tener que crear las interfaces de backend solamente para manejar el contenido.

source: One typical workflow in creating Django apps is to create models and get the admin sites up and running as fast as possible, so your staff (or clients) can start populating data. Then, develop the way data is presented to the public.
es: Un flujo típico al crear las apps Django es definir los modelos y configurar el sitio de administración corriendo tan rápido como sea posible, de tal forma que el staff (o los clientes) pueden empezar a agregar información. Y luego, desarrollar la manera en que esta información es presentada al público.

source: Design your URLs
es: Diseñar tus URLs

source: A clean, elegant URL scheme is an important detail in a high-quality Web application. Django encourages beautiful URL design and doesn't put any cruft in URLs, like ``.php`` or ``.asp``.
es: Un esquema de URLs limpio y elegante es un detalle importante en una aplicación web de calidad. Django incentiva el diseño elegante de URLs y no añade ningún sufijo como ``.php`` or ``.asp``.

source: To design URLs for an app, you create a Python module called a `URLconf <https://docs.djangoproject.com/en/1.8/topics/http/urls>`_. A table of contents for your app, it contains a simple mapping between URL patterns and Python callback functions. URLconfs also serve to decouple URLs from Python code.
es: Para diseñar las URLs de una app, hay que crear un módulo Python llamado `URLconf <https://docs.djangoproject.com/en/1.8/topics/http/urls>`_. Es una tabla de contenidos para tu app, contiene un simple mapeo entre patrones de URL y funciones Python. Los URLconfs también sirven para desacoplar las URLs del código Python.

source: Here's what a URLconf might look like for the ``Reporter``/``Article`` example above:
es: A continuación cómo podría ser un URLconf para el ejemplo anterior de ``Reporter``/``Article``:

source: The code above maps URLs, as simple `regular expressions`_, to the location of Python callback functions ("views"). The regular expressions use parenthesis to "capture" values from the URLs. When a user requests a page, Django runs through each pattern, in order, and stops at the first one that matches the requested URL. (If none of them matches, Django calls a special-case 404 view.) This is blazingly fast, because the regular expressions are compiled at load time.
es: El código de arriba mapea URLs, listadas como expresiones regulares simples, a la ubicación de funciones Python de callback ("views"). Las expresiones regulares usan paréntesis para "capturar" valores en las URLs. Cuando un usuario pide una página, Django recorre los patrones, en orden, y se detiene en el primero que coincide con la URL solicitada. (Si ninguno coincide, Django llama a un view especial para un 404.) Esto es muy rápido porque las expresiones regulares se compilan cuando se carga el código.

source: Once one of the regexes matches, Django imports and calls the given view, which is a simple Python function. Each view gets passed a request object -- which contains request metadata -- and the values captured in the regex.
es: Una vez que una de las expresiones regulares coincide, Django importa e invoca la view correspondiente, que es simplemente una función Python. Cada view recibe como argumentos un objeto request -- que contiene la metada del request -- y los valores capturados en la expresión regular.

source: For example, if a user requested the URL "/articles/2005/05/39323/", Django would call the function ``news.views.article_detail(request, '2005', '05', '39323')``.
es: Por ejemplo, si el usuario solicita la URL "/articles/2005/05/39323/", Django llamaría a la función ``news.views.article_detail(request, '2005', '05', '39323')``.

source: Write your views
es: Escribir tus views

source: Each view is responsible for doing one of two things: Returning an :class:`~django.http.HttpResponse` object containing the content for the requested page, or raising an exception such as :class:`~django.http.Http404`. The rest is up to you.
es: Cada view es responsable de hacer una de dos cosas: devolver un objeto :class:`~django.http.HttpResponse` con el contenido de la página solicitada, o levantar una excepción como :class:`~django.http.Http404`. El resto depende de cada uno.

source: Generally, a view retrieves data according to the parameters, loads a template and renders the template with the retrieved data. Here's an example view for ``year_archive`` from above:
es: Generalmente, una view obtiene datos de acuerdo a los parámetros que recibe, carga un template y lo renderiza usando esos datos. Este es un ejemplo de una view para ``year_archive`` siguiendo con el ejemplo anterior:

source: This example uses Django's `template system <https://docs.djangoproject.com/en/1.8/topics/templates>`_, which has several powerful features but strives to stay simple enough for non-programmers to use.
es: Este ejemplo usa el `sistema de templates <https://docs.djangoproject.com/en/1.8/topics/templates>`_ de Django, que tiene varias características poderosas pero es lo suficientemente simple de usar para no-programadores.

source: Design your templates
es: Diseñar tus templates

source: The code above loads the ``news/year_archive.html`` template.
es: El código anterior cargar el template ``news/year_archive.html``.

source: Django has a template search path, which allows you to minimize redundancy among templates. In your Django settings, you specify a list of directories to check for templates with :setting:`DIRS <TEMPLATES-DIRS>`. If a template doesn't exist in the first directory, it checks the second, and so on.
es: Django tiene un path de búsqueda de templates, que permite minimizar la redundancia. En tus settings, especificá una lista de directorios para revisar por templates en :setting:`DIRS <TEMPLATES-DIRS>`. Si un template no existe en el primer directorio, se busca en el segundo, y así sucesivamente.

source: Let's say the ``news/year_archive.html`` template was found. Here's what that might look like:
es: Supongamos que el template ``news/year_archive.html`` se encuentra, su contenido podría ser:

source: Variables are surrounded by double-curly braces. ``{{ article.headline }}`` means "Output the value of the article's headline attribute." But dots aren't used only for attribute lookup. They also can do dictionary-key lookup, index lookup and function calls.
es: Las variables se encierran entre doble llaves. ``{{ article.headline }}`` significa "Escribir el valor del atributo headline del objeto article." Pero los puntos no solamente se usan para atributos. También se usan para acceder a una clave de un diccionario, acceder a un índice y llamadas a función.

source: Note ``{{ article.pub_date|date:"F j, Y" }}`` uses a Unix-style "pipe" (the "|" character). This is called a template filter, and it's a way to filter the value of a variable. In this case, the date filter formats a Python datetime object in the given format (as found in PHP's date function).
es: Notar que ``{{ article.pub_date|date:"F j, Y" }}`` usa un "pipe" (el caracter "|") al estilo Unix. Se trata de lo que se llama un template filter, y es una manera de aplicar un filtro al valor de una variable. En este caso, el filtro date formatea un objeto datetime de Python con el formato dado (como en el caso de la función date de PHP).

source: You can chain together as many filters as you'd like. You can write `custom template filters <https://docs.djangoproject.com/en/1.8/howto/custom-template-tags/#howto-writing-custom-template-filters>`_. You can write `custom template tags <https://docs.djangoproject.com/en/1.8/howto/custom-template-tags>`_, which run custom Python code behind the scenes.
es: Podés encadenar tantos filtros como quieras. También podés `escribir filtros propios <https://docs.djangoproject.com/en/1.8/howto/custom-template-tags/#howto-writing-custom-template-filters>`_. Podés `escribir template tags personalizados <https://docs.djangoproject.com/en/1.8/howto/custom-template-tags>`_, que corren código Python propio detrás de escena.

source: Finally, Django uses the concept of "template inheritance". That's what the ``{% extends "base.html" %}`` does. It means "First load the template called 'base', which has defined a bunch of blocks, and fill the blocks with the following blocks." In short, that lets you dramatically cut down on redundancy in templates: each template has to define only what's unique to that template.
es: Finalmente, Django usa el concepto de "herencia de templates": eso es lo que hace ``{% extends "base.html" %}``. Significa "Primero cargar el template llamado 'base', que define una serie de bloques, y rellenar esos bloques con los siguientes bloques". En síntesis, permite recortar drásticamente la redundancia en los templates: cada template solamente tiene que definir lo que es único para él mismo.

source: Here's what the "base.html" template, including the use of `static files <https://docs.djangoproject.com/en/1.8/howto/static-files/index>`_, might look like:
es: El template "base.html", incluyendo el uso de `archivos estáticos <https://docs.djangoproject.com/en/1.8/howto/static-files/index>`_, podría ser algo como:

source: Simplistically, it defines the look-and-feel of the site (with the site's logo), and provides "holes" for child templates to fill. This makes a site redesign as easy as changing a single file -- the base template.
es: Simplificando, define el look-and-feel del sitio (con el logo del sitio) y provee los "espacios" para que los templates hijos completen. Esto hace que el rediseño de un sitio sea tan sencillo como modificar un único archivo -- el template base.

source: It also lets you create multiple versions of a site, with different base templates, while reusing child templates. Django's creators have used this technique to create strikingly different mobile versions of sites -- simply by creating a new base template.
es: También permite crear múltiple versiones de un sitio, con diferentes templates base y reusando los templates hijos. Los creadores de Django han usado esta técnica para crear completamente diferentes de sitios para su versión móvil -- simplemente creando un nuevo template base.

source: Note that you don't have to use Django's template system if you prefer another system. While Django's template system is particularly well-integrated with Django's model layer, nothing forces you to use it. For that matter, you don't have to use Django's database API, either. You can use another database abstraction layer, you can read XML files, you can read files off disk, or anything you want. Each piece of Django -- models, views, templates -- is decoupled from the next.
es: Hay que notar que si uno prefiere puede usar un sistema de templates distinto al de Django. Si bien el sistema de templates de Django está particularmente bien integrado con la capa de Django de modelos, nada nos fuerza a usarlo. Tampoco es obligatorio usar la capa de abstracción de la base de datos provista por Django. Se puede usar otra abstracción, leer de archivos XML, leer de archivos de disco, o lo que uno quiera. Cada pieza de Django -- modelos, views, templates -- está desacoplada del resto.

source: This is just the surface
es: Esto es sólo la superficie

source: This has been only a quick overview of Django's functionality. Some more useful features:
es: Esta es tan sólo un rápido vistazo a la funcionalidad de Django. Algunas otras características útiles:

source: A `caching framework <https://docs.djangoproject.com/en/1.8/topics/cache>`_ that integrates with memcached or other backends.
es: Un `framework de caching <https://docs.djangoproject.com/en/1.8/topics/cache>`_ que se integra con memcached y otros backends.

source: A `syndication framework <https://docs.djangoproject.com/en/1.8/ref/contrib/syndication>`_ that makes creating RSS and Atom feeds as easy as writing a small Python class.
es: Un `framework de sindicación <https://docs.djangoproject.com/en/1.8/ref/contrib/syndication>`_ que hace que crear feeds RSS y Atom sea tan fácil como escribir una pequeña clase Python.

source: More sexy automatically-generated admin features -- this overview barely scratched the surface.
es: Más y mejores características en la creación automática del sitio de administración -- esta introducción apenas trata el tema superficialmente.

source: The next obvious steps are for you to `download Django`_, read :doc:`the tutorial </intro/tutorial01>` and join `the community`_. Thanks for your interest!
es: Los siguientes pasos obvios son `bajar Django`_, leer el :doc:`tutorial </intro/tutorial01>` y unirse a `la comunidad`_. Gracias por tu interés!

source: Advanced tutorial: How to write reusable apps
es: Tutorial avanzado: Cómo escribir apps reusables

source: This advanced tutorial begins where :doc:`Tutorial 6 </intro/tutorial06>` left off. We'll be turning our Web-poll into a standalone Python package you can reuse in new projects and share with other people.
es: Este tutorial avanzado comienza donde dejó el :doc:`Tutorial 6 </intro/tutorial06>`. Vamos a convertir nuestra app en un paquete Python standalone de tal manera que se pueda reusar en nuevos proyectos y compartir con otra gente.

source: If you haven't recently completed Tutorials 1–6, we encourage you to review these so that your example project matches the one described below.
es: Si todavía no completaste los Tutoriales 1-5, te alentamos a hacerlo, ya que nos basaremos en ese proyecto durante este tutorial.

source: Reusability matters
es: La reusabilidad importa

source: It's a lot of work to design, build, test and maintain a web application. Many Python and Django projects share common problems. Wouldn't it be great if we could save some of this repeated work?
es: Es mucho trabajo diseñar, construir, testear y mantener una aplicación web. Varios proyectos Python y Django comparten problemas comunes. No sería bueno poder ahorrarse algo de este trabajo repetido?

source: Reusability is the way of life in Python. `The Python Package Index (PyPI) <https://pypi.python.org/pypi>`_ has a vast range of packages you can use in your own Python programs. Check out `Django Packages <https://www.djangopackages.com>`_ for existing reusable apps you could incorporate in your project. Django itself is also just a Python package. This means that you can take existing Python packages or Django apps and compose them into your own web project. You only need to write the parts that make your project unique.
es: Reusabilidad es el estilo de vida en Python. `The Python Package Index (PyPI) <https://pypi.python.org/pypi>`_ tiene un amplio abanico de paquetes que uno puede usar en sus propios programas Python. También vale la pena chequear `Django Packages <https://www.djangopackages.com>`_ para apps reusables que se pueden incorporar en nuestros proyectos. Django mismo es también un paquete Python. Esto significa que uno puede partir de paquetes Python o Django apps existentes y componerlos en un proyecto web propio. Solamente es necesario escribir las partes que hacen nuestro proyecto único.

source: Let's say you were starting a new project that needed a polls app like the one we've been working on. How do you make this app reusable? Luckily, you're well on the way already. In :doc:`Tutorial 3 </intro/tutorial03>`, we saw how we could decouple polls from the project-level URLconf using an ``include``. In this tutorial, we'll take further steps to make the app easy to use in new projects and ready to publish for others to install and use.
es: Digamos que estamos por comenzar un nuevo proyecto que necesita una app de encuestas como la que hemos estado desarrollando. Cómo hacemos que sea reusable? Afortunadamente, estamos en el buen camino. En el :doc:`Tutorial 3 </intro/tutorial03>` vimos como desacoplar la app ``polls`` del URLconf a nivel proyecto usando ``include``. En este tutorial vamos a ir más allá para lograr que nuestra app sea fácil de usar en nuevos proyectos y quede lista para publicarla y que otros puedan instalarla y usarla.

source: Package? App?
es: Paquete? App?

source: A Python `package <https://docs.python.org/tutorial/modules.html#packages>`_ provides a way of grouping related Python code for easy reuse. A package contains one or more files of Python code (also known as "modules").
es: Un `paquete Python <https://docs.python.org/tutorial/modules.html#packages>`_ provee una manera de agrupar código Python relacionado para facilitar su reuso. Un paquete contiene uno o más archivos de código Python (también conocidos como "módulos").

source: A package can be imported with ``import foo.bar`` or ``from foo import bar``. For a directory (like ``polls``) to form a package, it must contain a special file ``__init__.py``, even if this file is empty.
es: Un paquete se puede importar con ``import foo.bar`` o ``from foo import bar``. Para que un directorio (como ``polls``) sea un paquete, debe contener un archivo especial, ``__init__.py``, que incluso puede estar vacío.

source: A Django *application* is just a Python package that is specifically intended for use in a Django project. An application may use common Django conventions, such as having ``models``, ``tests``, ``urls``, and ``views`` submodules.
es: Una *app* Django es sólo un paquete Python que está pensado específicamente para usarse en un proyecto Django. Una app puede también usar algunas convenciones comunes de Django, como tener un archivo ``models.py``.

source: Later on we use the term *packaging* to describe the process of making a Python package easy for others to install. It can be a little confusing, we know.
es: Más adelante usamos el término *empaquetar* para describir el proceso de hacer que un paquete Python sea fácil de instalar para otros. Puede resultar un poco confuso, lo sabemos.

source: Your project and your reusable app
es: Nuestro proyecto y nuestra app reusable

source: After the previous tutorials, our project should look like this::
es: Después de los tutoriales anteriores, nuestro proyecto debería verse así::

source: You created ``mysite/templates`` in :doc:`Tutorial 2 </intro/tutorial02>`, and ``polls/templates`` in :doc:`Tutorial 3 </intro/tutorial03>`. Now perhaps it is clearer why we chose to have separate template directories for the project and application: everything that is part of the polls application is in ``polls``. It makes the application self-contained and easier to drop into a new project.
es: Creamos ``mysite/templates`` en el :doc:`Tutorial 2 </intro/tutorial02>`, y ``polls/templates`` en el :doc:`Tutorial 3 </intro/tutorial03>`. Ahora quizás es más claro por qué elegimos tener directorios separados de templates para el proyecto y la aplicación: todo lo que es parte de la app polls está en ``polls``. Esto permite que la aplicación esté auto-contenido y sea más fácil reusarla en otro proyecto.

source: The ``polls`` directory could now be copied into a new Django project and immediately reused. It's not quite ready to be published though. For that, we need to package the app to make it easy for others to install.
es: Ahora el directorio ``polls`` podría copiarse en un nuevo proyecto Django y ser reusado inmediatemente. Todavía no está listo para publicarse, sin embargo. Para ello necesitamos empaquetar la app y hacer fácil su instalación para otros.

source: Installing some prerequisites
es: Instalando algunos prerrequisitos

source: The current state of Python packaging is a bit muddled with various tools. For this tutorial, we're going to use setuptools_ to build our package. It's the recommended packaging tool (merged with the ``distribute`` fork). We'll also be using `pip`_ to install and uninstall it. You should install these two packages now. If you need help, you can refer to `how to install Django with pip <https://docs.djangoproject.com/en/1.8/topics/install/#installing-official-release>`_. You can install ``setuptools`` the same way.
es: El estado actual del empaquetado en Python está un poco confuso con varias herramientas. Para este tutorial vamos a usar setuptools_ para construir nuestro paquete. Es la herramienta recomendada (unida al fork de ``distribute``). Vamos a usar también `pip`_ para instalarlo y desinstalarlo. Deberías instalar estos dos paquetes ahora. Si necesitaras ayuda, podés chequear `cómo instalar Django con pip <https://docs.djangoproject.com/en/1.8/topics/install/#installing-official-release>`_. De la misma manera se puede instalar ``setuptools``.

source: Packaging your app
es: Empaquetando nuestra app

source: Python *packaging* refers to preparing your app in a specific format that can be easily installed and used. Django itself is packaged very much like this. For a small app like polls, this process isn't too difficult.
es: El *empaquetar* Python se refiere a preparar nuestra app en un formato específico que pueda ser fácilmente instalable para su uso. Django mismo viene empaquetado de forma muy similar. Para una app pequeña como ``polls``, el proceso no es muy complicado.

source: First, create a parent directory for ``polls``, outside of your Django project. Call this directory ``django-polls``.
es: Primero, creamos un directorio padre para ``polls``, fuera del proyecto Django. Llamaremos a este directorio ``django-polls``.

source: Choosing a name for your app
es: Eligiendo un nombre para nuestra app
