Repository: igorrocha/django-tutorial
Catalog: locale/*/LC_MESSAGES/intro.po
Languages: es

source: If you're interested, you can also run :djadmin:`python manage.py check <check>`; this checks for any problems in your project without making migrations or touching the database.
es: Si te interesa, también podés correr :djadmin:`python manage.py check <check>`; este comando chequea por cualqueir problema en tu proyecto sin aplicar las migraciones ni tocar la base de datos.

source: Now, run :djadmin:`migrate` again to create those model tables in your database:
es: Ahora corramos :djadmin:`migrate` de nuevo para crear las tablas correspondientes a nuestros modelos en la base de datos:

source: The :djadmin:`migrate` command takes all the migrations that haven't been applied (Django tracks which ones are applied using a special table in your database called ``django_migrations``) and runs them against your database - essentially, synchronizing the changes you made to your models with the schema in the database.
es: El comando :djadmin:`migrate` toma todas las migraciones que no se aplicaron (Django lleva registro de cuáles se aplicaron usando una tabla especial en la base de datos llamada ``django_migrations``) y las corre contra la base de datos - esencialmente, sincroniza el esquema de la base de datos con los cambios hechos a nuestros modelos.

source: Migrations are very powerful and let you change your models over time, as you develop your project, without the need to delete your database or tables and make new ones - it specializes in upgrading your database live, without losing data. We'll cover them in more depth in a later part of the tutorial, but for now, remember the three-step guide to making model changes:
es: Las migraciones son muy poderosas y nos permiten cambiar nuestros modelos a lo largo del tiempo, mientras se avanza con el proyecto, sin necesidad de borrar la base de datos o las tablas, y crear nuevas - se especializa en actualizar la base de datos sin perder información. Las veremos en más detalle en una parte más adelante del tutorial, pero por ahora, recordermos los 3 pasos para hacer cambios a nuestros modelos:

source: Change your models (in ``models.py``).
es: Cambiar nuestros modelos (en ``models.py``).

source: Run :djadmin:`python manage.py makemigrations <makemigrations>` to create migrations for those changes
es: Correr :djadmin:`python manage.py makemigrations <makemigrations>` para crear las migraciones correspondientes a esos cambios

source: Run :djadmin:`python manage.py migrate <migrate>` to apply those changes to the database.
es: Correr :djadmin:`python manage.py migrate <migrate>` para aplicar esos cambios a la base de datos.

source: The reason there's separate commands to make and apply migrations is because you'll commit migrations to your version control system and ship them with your app; they not only make your development easier, they're also useable by other developers and in production.
es: La razón por la que hay comandos separados para crear y aplicar migraciones es porque vas a necesitar hacer commit de las migraciones en tu sistema de control de versiones y distribuirlas con tu app; no solamente hacen tu desarrollo más simple, también son reusables por otros desarrolladores y en producción.

source: Read the `django-admin documentation <https://docs.djangoproject.com/en/1.8/ref/django-admin>`_ for full information on what the ``manage.py`` utility can do.
es: Para tener la información completa de qué puede hacer la utilidad ``manage.py``, podés leer la documentación de `django-admin.py <https://docs.djangoproject.com/en/1.8/ref/django-admin>`_.

source: Playing with the API
es: Jugando con la API

source: Now, let's hop into the interactive Python shell and play around with the free API Django gives you. To invoke the Python shell, use this command:
es: Ahora pasemos al intérprete interactivo de Python y juguemos con la API que Django nos provee. Para invocar el shell de Python, usamos este comando:

source: We're using this instead of simply typing "python", because :file:`manage.py` sets the ``DJANGO_SETTINGS_MODULE`` environment variable, which gives Django the Python import path to your :file:`mysite/settings.py` file.
es: Usamos esto en lugar de simplemente tipear \"python\" porque :file:`manage.py` setea la variable de entorno ``DJANGO_SETTINGS_MODULE``, que le da a Django el import path al archivo :file:`mysite/settings.py`.

source: Bypassing manage.py
es: Evitando manage.py

source: If you'd rather not use :file:`manage.py`, no problem. Just set the :envvar:`DJANGO_SETTINGS_MODULE` environment variable to ``mysite.settings``, start a plain Python shell, and set up Django:
es: Si preferís no usar :file:`manage.py`, no hay problema. Basta setear la variable de entorno :envvar:`DJANGO_SETTINGS_MODULE` a ``mysite.settings``, levantar un shell de Python, y configurar Django:

source: If this raises an :exc:`AttributeError`, you're probably using a version of Django that doesn't match this tutorial version. You'll want to either switch to the older tutorial or the newer Django version.
es: Si esto levanta una excepción :exc:`AttributeError`, probablemente estás usando una versión de Django que no coincide con la de este tutorial. Deberías cambiar a la versión del tutorial (o conseguir la versión de Django) correspondiente.

source: You must run ``python`` from the same directory :file:`manage.py` is in, or ensure that directory is on the Python path, so that ``import mysite`` works.
es: Tenés que correr ``python`` en el mismo directorio que está :file:`manage.py`, o asegurarte de que ese directorio está en el Python path, para que ``import mysite`` funcione.

source: For more information on all of this, see the `django-admin documentation <https://docs.djangoproject.com/en/1.8/ref/django-admin>`_.
es: Para más información sobre todo esto, ver `la documentación de django-admin <https://docs.djangoproject.com/en/1.8/ref/django-admin>`_.

source: Once you're in the shell, explore the `database API <https://docs.djangoproject.com/en/1.8/topics/db/queries>`_::
es: Una vez en el shell, exploramos la `API de base de datos <https://docs.djangoproject.com/en/1.8/topics/db/queries>`_::

source: Wait a minute. ``<Question: Question object>`` is, utterly, an unhelpful representation of this object. Let's fix that by editing the ``Question`` model (in the ``polls/models.py`` file) and adding a :meth:`~django.db.models.Model.__str__` method to both ``Question`` and ``Choice``:
es: Un minuto. ``<Question: Question object>`` es, definitivamente, una representación poco útil de este objeto. Arreglemos esto editando los modelos (en el archivo ``polls/models.py``) y agregando el método :meth:`~django.db.models.Model.__str__` a ``Question`` y ``Choice``:

source: It's important to add :meth:`~django.db.models.Model.__str__` methods to your models, not only for your own convenience when dealing with the interactive prompt, but also because objects' representations are used throughout Django's automatically-generated admin.
es: Es importante agregar el método :meth:`~django.db.models.Model.__str__` a nuestros modelos, no sólo por nuestra salud al tratar con el intérprete, sino también porque es la representación usada por Django en la interfaz de administración autogenerada.

source: ``__str__`` or ``__unicode__``?
es: ``__str__`` o ``__unicode__``?

source: On Python 3, it's easy, just use :meth:`~django.db.models.Model.__str__`.
es: En Python 3, es fácil, usamos :meth:`~django.db.models.Model.__str__`.

source: On Python 2, you should define :meth:`~django.db.models.Model.__unicode__` methods returning ``unicode`` values instead. Django models have a default :meth:`~django.db.models.Model.__str__` method that calls :meth:`~django.db.models.Model.__unicode__` and converts the result to a UTF-8 bytestring. This means that ``unicode(p)`` will return a Unicode string, and ``str(p)`` will return a bytestring, with characters encoded as UTF-8. Python does the opposite: ``object`` has a ``__unicode__`` method that calls ``__str__`` and interprets the result as an ASCII bytestring. This difference can create confusion.
es: En Python 2, deberíamos en vez definir el método :meth:`~django.db.models.Model.__unicode__` que devuelva valores ``unicode``. Los modelos de Django tienen una implementación por defecto de :meth:`~django.db.models.Model.__str__` que llama a :meth:`~django.db.models.Model.__unicode__` y convierte el resultado a un bytestring UTF-8. Esto quiere decir que ``unicode(p)`` devuelve un string Unicode, y ``str(p)`` devuelve un bytestring, encodeado en UTF-8. Python hace lo contrario: ``object`` tiene un método ``__unicode__`` que llama a ``__str__`` e interpreta el resultado como un bytestring ASCII. Esta diferencia puede generar confusión.

source: If all of this is gibberish to you, just use Python 3.
es: Si todo esto es mucho ruido, usá Python 3.

source: Note these are normal Python methods. Let's add a custom method, just for demonstration:
es: Notar que estos son métodos Python normales. Agreguemos uno más, como demostración:

source: Note the addition of ``import datetime`` and ``from django.utils import timezone``, to reference Python's standard :mod:`datetime` module and Django's time-zone-related utilities in :mod:`django.utils.timezone`, respectively. If you aren't familiar with time zone handling in Python, you can learn more in the `time zone support docs <https://docs.djangoproject.com/en/1.8/topics/i18n/timezones>`_.
es: Notar que agregamos ``import datetime`` y ``from django.utils import timezone``, para referenciar el módulo :mod:`datetime` de la librería estándar de Python y las utilidades de Django relacionadas a zonas horarias en :mod:`django.utils.timezone`, respectivamente. Si no estás familiarizado con el manejo de zonas horarias en Python, podés aprender más en la `documentación de time zone <https://docs.djangoproject.com/en/1.8/topics/i18n/timezones>`_.

source: Save these changes and start a new Python interactive shell by running ``python manage.py shell`` again::
es: Guardamos los cambios y empezamos una nueva sesión en el shell corriendo ``python manage.py shell`` nuevamente::

source: For more information on model relations, see `Accessing related objects <https://docs.djangoproject.com/en/1.8/ref/models/relations>`_. For more on how to use double underscores to perform field lookups via the API, see `Field lookups <https://docs.djangoproject.com/en/1.8/topics/db/queries/#field-lookups-intro>`_. For full details on the database API, see our `Database API reference <https://docs.djangoproject.com/en/1.8/topics/db/queries>`_.
es: Para más información sobre relaciones en modelos, ver `Acceder objetos relacionados <https://docs.djangoproject.com/en/1.8/ref/models/relations>`_. Para más detalles sobre cómo usar los doble guión bajo para efectuar búsquedas usando la API, ver `Field lookups <https://docs.djangoproject.com/en/1.8/topics/db/queries/#field-lookups-intro>`_. Para el detalle completo de la API de base de datos, ver `Database API reference <https://docs.djangoproject.com/en/1.8/topics/db/queries>`_.

source: When you're comfortable with the API, read :doc:`part 2 of this tutorial </intro/tutorial02>` to get Django's automatic admin working.
es: Cuando te sientas confortable con la API, podés pasar a :doc:`parte 2 del tutorial </intro/tutorial02>` para tener funcionando la interfaz automática de administración de Django.

source: Writing your first Django app, part 2
es: Escribiendo tu primera Django app, parte 2

source: This tutorial begins where :doc:`Tutorial 1 </intro/tutorial01>` left off. We're continuing the Web-poll application and will focus on Django's automatically-generated admin site.
es: Este tutorial comienza donde dejó :doc:`Tutorial 1 </intro/tutorial01>`. Continuaremos con la aplicación de encuestas y nos concentraremos en la interfaz de administración (que llamaremos 'admin') que Django genera automáticamente.

source: Generating admin sites for your staff or clients to add, change and delete content is tedious work that doesn't require much creativity. For that reason, Django entirely automates creation of admin interfaces for models.
es: Generar sitios de administración para que gente de staff o clientes agreguen, cambien y borren contenido es un trabajo tedioso que no requiere mucha creatividad. Por esta razón, Django automatiza completamente la creación de una interfaz de administración para los modelos.

source: Django was written in a newsroom environment, with a very clear separation between "content publishers" and the "public" site. Site managers use the system to add news stories, events, sports scores, etc., and that content is displayed on the public site. Django solves the problem of creating a unified interface for site administrators to edit content.
es: Django fue escrito en el ambiente de una sala de noticias, con una separación muy clara entre "administradores de contenido" y el sitio "público". Los administradores del sitio usan el sistema para agregar noticias, eventos, resultados deportivos, etc., y el contenido se muestra en el sitio público. Django resuelve el problema de crear una interfaz unificada para que los administradores editen contenido.

source: The admin isn't intended to be used by site visitors. It's for site managers.
es: El admin no está pensado para ser usado por los visitantes de un sitio, sino para los administradores del mismo.

source: Creating an admin user
es: Creando un usuario admin

source: First we'll need to create a user who can login to the admin site. Run the following command:
es: Primero vamos a necesitar crear un usuario que pueda loguearse al sitio de administración. Corremos el siguiente comando:

source: Enter your desired username and press enter.
es: Ingresamos el nombre usuario que querramos y presionamos enter.

source: You will then be prompted for your desired email address:
es: Deberemos ingresar la dirección de email:

source: The final step is to enter your password. You will be asked to enter your password twice, the second time as a confirmation of the first.
es: El último paso es ingresar el password. Deberemos ingresarlo dos veces, la segunda como una confirmación de la primera.

source: Start the development server
es: Levantar el servidor de desarrollo

source: The Django admin site is activated by default. Let's start the development server and explore it.
es: El sitio de admin de Django está habilitado por defecto. Levantemos el servidor de desarrollo y exploremoslo.

source: Recall from Tutorial 1 that you start the development server like so:
es: Recordemos del Tutorial 1 que para empezar el servidor de desarrollo debemos correr:

source: Now, open a Web browser and go to "/admin/" on your local domain -- e.g., http://127.0.0.1:8000/admin/. You should see the admin's login screen:
es: Ahora, abrimos un browser y vamos a "/admin/" en el dominio local -- e.g., http://127.0.0.1:8000/admin/. Deberíamos ver la pantalla de login del admin:

source: Since `translation <https://docs.djangoproject.com/en/1.8/topics/i18n/translation>`_ is turned on by default, the login screen may be displayed in your own language, depending on your browser's settings and on whether Django has a translation for this language.
es: Dado que `translation <https://docs.djangoproject.com/en/1.8/topics/i18n/translation>`_ está activado por defecto, la pantalla de login podría mostrarse en tu propio idioma, dependiendo de la configuración de tu browser y de si Django tiene las traducciones para dicho idioma.

source: Doesn't match what you see?
es: No coincide con lo que ves?

source: If at this point, instead of the above login page, you get an error page reporting something like::
es: Si en este punto en lugar de la pantalla de login de arriba obtenés una página de error reportando algo como::

source: then you're probably using a version of Django that doesn't match this tutorial version. You'll want to either switch to the older tutorial or the newer Django version.
es: entonces probablemente estás usando una versión de Django que no coincide con la de este tutorial. Deberías cambiar a una versión anterior del tutorial o a una versión más nueva de Django.

source: Enter the admin site
es: Ingresar al admin

source: Now, try logging in with the superuser account you created in the previous step. You should see the Django admin index page:
es: Ahora intentemos loguearnos con la cuenta de superusuario que creamos en el paso anterior. Deberíamos ver la página inicial del admin de Django:

source: You should see a few types of editable content: groups and users. They are provided by :mod:`django.contrib.auth`, the authentication framework shipped by Django.
es: Deberíamos ver unos pocos tipos de contenido editable: grupos y usuarios. Éstos vienen provistos por :mod:`django.contrib.auth`, el framework de autenticación que viene con Django.

source: Make the poll app modifiable in the admin
es: Hacer la app poll modificable en el admin

source: But where's our poll app? It's not displayed on the admin index page.
es: Dónde está nuestra app poll? No se muestra en la página del admin.

source: Just one thing to do: we need to tell the admin that ``Question`` objects have an admin interface. To do this, open the :file:`polls/admin.py` file, and edit it to look like this:
es: Hay una cosa que hacer: necesitamos decirle al admin que los objetos ``Question`` tengan una interfaz de administración. Para esto abrimos el archivo :file:`polls/admin.py`, y lo editamos para que tenga el siguiente contenido:

source: Explore the free admin functionality
es: Explorar la funcionalidad del admin

source: Now that we've registered ``Question``, Django knows that it should be displayed on the admin index page:
es: Ahora que registramos ``Question``, Django sabe que se debe mostrar en la página del admin:

source: Click "Questions". Now you're at the "change list" page for questions. This page displays all the questions in the database and lets you choose one to change it. There's the "What's up?" question we created in the first tutorial:
es: Hacemos click en "Questions". Ahora estamos en la página de listado (change list) de preguntas. Esta página muestra todas las preguntas en la base de datos y nos permite elegir una para modificarla. Está la pregunta "What's up" que creamos en la primera parte:

source: Click the "What's up?" question to edit it:
es: Cliqueamos en ella para editarla:

source: Things to note here:
es: Cosas para notar aquí:

source: The form is automatically generated from the ``Question`` model.
es: El form es generado automáticamente a partir del modelo ``Question``.

source: The different model field types (:class:`~django.db.models.DateTimeField`, :class:`~django.db.models.CharField`) correspond to the appropriate HTML input widget. Each type of field knows how to display itself in the Django admin.
es: Los diferentes tipos de campo del modelo (:class:`~django.db.models.DateTimeField`, :class:`~django.db.models.CharField`) se corresponden con el widget HTML apropiado. Cada tipo de campo sabe cómo mostrarse en el admin de Django.

source: Each :class:`~django.db.models.DateTimeField` gets free JavaScript shortcuts. Dates get a "Today" shortcut and calendar popup, and times get a "Now" shortcut and a convenient popup that lists commonly entered times.
es: Cada :class:`~django.db.models.DateTimeField` tiene atajos JavaScript. La fecha tienen un atajo para "Hoy" (Today) y un popup de calendario, y la hora un "Ahora" (Now) y un popup que lista las horas más comunes.

source: The bottom part of the page gives you a couple of options:
es: El cierre de la página nos da algunas opciones:

source: Save -- Saves changes and returns to the change-list page for this type of object.
es: Guardar (Save) -- Guarda los cambios y nos devuelve a la página listado para este tipo de objeto.

source: Save and continue editing -- Saves changes and reloads the admin page for this object.
es: Grabar y continuar editando (Save and continue editing) -- Guarda los cambios y recarga la página del admin de este objeto.

source: Save and add another -- Saves changes and loads a new, blank form for this type of object.
es: Grabar y agregar otro (Save and add another) -- Guarda los cambios y carga un form nuevo, en blanco, que permite agregar un nuevo objeto de este tipo.

source: Delete -- Displays a delete confirmation page.
es: Eliminar (Delete) -- Muestra una página de confirmación de borrado.

source: If the value of "Date published" doesn't match the time when you created the question in Tutorial 1, it probably means you forgot to set the correct value for the :setting:`TIME_ZONE` setting. Change it, reload the page and check that the correct value appears.
es: Si el valor de "Date published" no coincide con el establecido durante la creación del objeto en Tutorial 1, probablemente sea que olvidaste setear el valor correcto para el :setting:`TIME_ZONE`. Revisalo, recargá la página y chequeá que se muestra el valor correcto.

source: Change the "Date published" by clicking the "Today" and "Now" shortcuts. Then click "Save and continue editing." Then click "History" in the upper right. You'll see a page listing all changes made to this object via the Django admin, with the timestamp and username of the person who made the change:
es: Cambiamos el valor de "Date published" haciendo click en "Today" y "Now". Luego hacemos click en "Save and continue editing". Si hacemos click en "History" arriba a la derecha, podemos ver una página que lista todos los cambios hechos a este objeto a través del admin, con la fecha/hora y el nombre de usuario de la persona que hizo el cambio:

source: Customize the admin form
es: Personalizar el form del admin

source: Take a few minutes to marvel at all the code you didn't have to write. By registering the ``Question`` model with ``admin.site.register(Question)``, Django was able to construct a default form representation. Often, you'll want to customize how the admin form looks and works. You'll do this by telling Django the options you want when you register the object.
es: Lleva unos pocos minutos maravillarse por todo el código que no tuvimos que escribir. Sólo registrando el modelo ``Question`` con ``admin.site.register(Question)``, Django fue capaz de construir una representación con un form por defecto. A menudo uno querrá personalizar cómo este form se ve y funciona. Esto lo hacemos pasando algunas opciones a Django cuando registramos el modelo.

source: Let's see how this works by re-ordering the fields on the edit form. Replace the ``admin.site.register(Question)`` line with:
es: Veamos cómo funciona reordenando los campos en el form de edición. Reemplazamos la línea ``admin.site.register(Question)`` por:

source: You'll follow this pattern -- create a model admin object, then pass it as the second argument to ``admin.site.register()`` -- any time you need to change the admin options for an object.
es: Seguiremos este patrón -- creamos un objeto model admin, que luego pasamos como segundo argumento de ``admin.site.register()`` -- cada vez que necesitemos cambiar alguna opción del admin para un modelo.

source: This particular change above makes the "Publication date" come before the "Question" field:
es: Este cambio en particular hace que "Publication date" se muestre antes que el campo "Question":

source: This isn't impressive with only two fields, but for admin forms with dozens of fields, choosing an intuitive order is an important usability detail.
es: No es muy impresionante con sólo dos campos, pero para forms con docenas de campos, elegir un orden intuitivo es un detalle de usabilidad importante.
