Repository: igorrocha/django-tutorial
Catalog: locale/*/LC_MESSAGES/intro.po
Languages: es

source: Month-based archive page -- displays all days with entries in the given month.
es: Archivo mensual -- muestra los días de un mes con las correspondientes entradas.

source: Day-based archive page -- displays all entries in the given day.
es: Archivo diario -- muestra todas las entradas en un día dado.

source: Comment action -- handles posting comments to a given entry.
es: Acción de comentar -- maneja el posteo de comentarios en una entrada dada.

source: In our poll application, we'll have the following four views:
es: En nuestra aplicación de preguntas, vamos a tener las siguientes cuatro views:

source: Question "index" page -- displays the latest few questions.
es: Página índice -- muestra las últimas preguntas.

source: Question "detail" page -- displays a question text, with no results but with a form to vote.
es: Detalle de pregunta -- muestra el texto de la pregunta, sin resultados, junto con un form para votar.

source: Question "results" page -- displays results for a particular question.
es: Página de resultados -- muestra los resultados para una pregunta particular.

source: Vote action -- handles voting for a particular choice in a particular question.
es: Acción de votar -- maneja el voto por una opción particular en una pregunta dada.

source: In Django, web pages and other content are delivered by views. Each view is represented by a simple Python function (or method, in the case of class-based views). Django will choose a view by examining the URL that's requested (to be precise, the part of the URL after the domain name).
es: En Django, las páginas web y otro contenido se manejan mediante views. Cada view se representa por una simple función Python (o método, en el caso de views basadas en clases). Django elige una view examinando la URL que se pidió (para ser precisos, la parte de la URL después del nombre de dominio).

source: Now in your time on the web you may have come across such beauties as "ME2/Sites/dirmod.asp?sid=&type=gen&mod=Core+Pages&gid=A6CD4967199A42D9B65B1B". You will be pleased to know that Django allows us much more elegant *URL patterns* than that.
es: En la web puede que te hayas encontrado con cosas como "ME2/Sites/dirmod.asp?sid=&type=gen&mod=Core+Pages&gid=A6CD4967199A42D9B65B1B". Estarás encantado de saber que Django permite definir *patrones de URL* mucho más elegantes.

source: A URL pattern is simply the general form of a URL - for example: ``/newsarchive/<year>/<month>/``.
es: Un patrón de URL es simplemente la forma genérica de una URL - por ejemplo: ``/newsarchive/<year>/<month>/``.

source: To get from a URL to a view, Django uses what are known as 'URLconfs'. A URLconf maps URL patterns (described as regular expressions) to views.
es: Para llegar de una URL a una view, Django usa lo que se conoce como 'URLconfs'. Un URLconf mapea patrones de URL (descriptos como expresiones regulares) a views.

source: This tutorial provides basic instruction in the use of URLconfs, and you can refer to :mod:`django.core.urlresolvers` for more information.
es: Este tutorial provee las instrucciones básicas para el uso de URLconfs, para más información referirse a :mod:`django.core.urlresolvers`.

source: Write your first view
es: Escribiendo nuestra primera view

source: Let's write the first view. Open the file ``polls/views.py`` and put the following Python code in it:
es: Escribamos nuestra primera view. Abrimos el archivo ``polls/views.py`` y ponemos el siguiente código Python:

source: This is the simplest view possible in Django. To call the view, we need to map it to a URL - and for this we need a URLconf.
es: Esta es la view más simple posible en Django. Para llamar a esta view, necesitamos mapearla a una URL - y para ello necesitamos un URLconf.

source: To create a URLconf in the polls directory, create a file called ``urls.py``. Your app directory should now look like::
es: Para crear un URLconf, en el directorio polls creamos un archivo llamado ``urls.py``. La estructura de directorios de nuestra app ahora debería verse así::

source: In the ``polls/urls.py`` file include the following code:
es: En el archivo ``polls/urls.py`` incluimos el siguiente código:

source: The next step is to point the root URLconf at the ``polls.urls`` module. In ``mysite/urls.py`` insert an :func:`~django.conf.urls.include`, leaving you with:
es: El próximo paso es apuntar el URLconf raíz al módulo ``polls.urls``. En ``mysite/urls.py`` insertamos un :func:`~django.conf.urls.include`, con lo que nos quedaría:

source: If you're seeing ``admin.autodiscover()`` before the definition of ``urlpatterns``, you're probably using a version of Django that doesn't match this tutorial version. You'll want to either switch to the older tutorial or the newer Django version.
es: Si estás viendo ``admin.autodiscover()`` antes de la definición de ``urlpatterns``, probablemente estás usando una versión de Django que no coincide con la de este tutorial. Deberías cambiar a una versión anterior del tutorial o a una versión más nueva de Django.

source: You have now wired an ``index`` view into the URLconf. Go to http://localhost:8000/polls/ in your browser, and you should see the text "*Hello, world. You're at the polls index.*", which you defined in the ``index`` view.
es: Hemos conectado una view ``index`` en el URLconf. Si vamos a la dirección http://localhost:8000/polls/ en nuestro browser, deberíamos ver el texto "*Hello, world. You're at the polls index.*", que definimos la view ``index``.

source: The :func:`~django.conf.urls.url` function is passed four arguments, two required: ``regex`` and ``view``, and two optional: ``kwargs``, and ``name``. At this point, it's worth reviewing what these arguments are for.
es: La función :func:`~django.conf.urls.url` toma cuatro argumentos, dos requeridos: ``regex`` y ``view``, y dos opcionales: ``kwargs``, y ``name``. En este punto vale la pena revisar para que es cada uno de ellos.

source: :func:`~django.conf.urls.url` argument: regex
es: :func:`~django.conf.urls.url`: argumento regex

source: The term "regex" is a commonly used short form meaning "regular expression", which is a syntax for matching patterns in strings, or in this case, url patterns. Django starts at the first regular expression and makes its way down the list, comparing the requested URL against each regular expression until it finds one that matches.
es: El término "regex" se usa comúnmente como abreviatura para `expresión regular` (`regular expression`, en inglés), que es una forma de describir patrones que se verifiquen en un string, o en este caso patrones de url. Django comienza en la primera expresión regular y va recorriendo la lista hacia abajo, comparando la URL solicitada contra cada expresión regular hasta encontrar una cuyo patrón coincida.

source: Note that these regular expressions do not search GET and POST parameters, or the domain name. For example, in a request to ``http://www.example.com/myapp/``, the URLconf will look for ``myapp/``. In a request to ``http://www.example.com/myapp/?page=3``, the URLconf will also look for ``myapp/``.
es: Notar que estas expresiones regulares no chequean parámetros de GET o POST, o el nombre de dominio. Por ejemplo, en un pedido por ``http://www.example.com/myapp/``, el URLconf buscará por ``myapp/``. En un pedido por ``http://www.example.com/myapp/?page=3``, el URLconf también buscará por ``myapp/``.

source: If you need help with regular expressions, see `Wikipedia's entry`_ and the documentation of the :mod:`re` module. Also, the O'Reilly book "Mastering Regular Expressions" by Jeffrey Friedl is fantastic. In practice, however, you don't need to be an expert on regular expressions, as you really only need to know how to capture simple patterns. In fact, complex regexes can have poor lookup performance, so you probably shouldn't rely on the full power of regexes.
es: Si necesitaras ayuda con las expresiones regulares, podés ver `Wikipedia`_ y la documentación del módulo :mod:`re`. También es fantástico, el libro de O'Reilly "Mastering Regular Expressions", de Jeffrey Friedl. En la práctica, sin embargo, no hace falta ser un experto en expresiones regulares, ya que lo que realmente es necesario saber es cómo capturar patrones simples. De hecho, expresiones regulares complejas pueden afectar la performance de búsqueda, por lo que uno no debería confiar en todo el poder de las expresiones regulares.

source: Finally, a performance note: these regular expressions are compiled the first time the URLconf module is loaded. They're super fast (as long as the lookups aren't too complex as noted above).
es: Finalmente, una nota sobre performance: estas expresiones regulares se compilan la primera vez que el módulo URLconf se carga. Son súper rápidas (mientras que no sean complejas como se menciona arriba).

source: :func:`~django.conf.urls.url` argument: view
es: :func:`~django.conf.urls.url`: argumento view

source: When Django finds a regular expression match, Django calls the specified view function, with an :class:`~django.http.HttpRequest` object as the first argument and any “captured” values from the regular expression as other arguments. If the regex uses simple captures, values are passed as positional arguments; if it uses named captures, values are passed as keyword arguments. We'll give an example of this in a bit.
es: Cuando Django encuentra una expresión regular que coincide, se llama a la función view especificada, con un objeto :class:`~django.http.HttpRequest` como primer argumento y los valores que se hayan “capturado” a partir de la expresión regular como argumentos restantes. Si la regex usa capturas simples (sin nombre), los valores se pasan como argumentos posicionales; si se usan capturas con nombre, los valores se pasan como argumentos nombrados. Veremos un ejemplo en breve.

source: :func:`~django.conf.urls.url` argument: kwargs
es: :func:`~django.conf.urls.url`: argumento kwargs

source: Arbitrary keyword arguments can be passed in a dictionary to the target view. We aren't going to use this feature of Django in the tutorial.
es: Se pueden pasar argumentos arbitrarios en un diccionario a la view de destino. No vamos a usar esta opción en el tutorial.

source: :func:`~django.conf.urls.url` argument: name
es: :func:`~django.conf.urls.url`: argumento name

source: Naming your URL lets you refer to it unambiguously from elsewhere in Django especially templates. This powerful feature allows you to make global changes to the url patterns of your project while only touching a single file.
es: Nombrar las URL nos permite referirnos a ellas de forma unívoca desde distintas partes del código, especialmente en los templates. Esta característica nos permite hacer cambios globales a los patrones de url del proyecto cambiando tan sólo un archivo (ya que el nombre permanece sin cambios, y nos referimos a una URL por su nombre).

source: Writing more views
es: Escribiendo más views

source: Now let's add a few more views to ``polls/views.py``. These views are slightly different, because they take an argument:
es: Ahora agreguemos algunas views más a ``polls/views.py``. Estas views van a ser un poco diferentes porque van a tomar un argumento:

source: Wire these new views into the ``polls.urls`` module by adding the following :func:`~django.conf.urls.url` calls:
es: Conectemos estas nuevas views en el módulo ``polls.urls`` agregando las siguientes llamadas a :func:`~django.conf.urls.url`:

source: Take a look in your browser, at "/polls/34/". It'll run the ``detail()`` method and display whatever ID you provide in the URL. Try "/polls/34/results/" and "/polls/34/vote/" too -- these will display the placeholder results and voting pages.
es: Veamos en nuestro browser "/polls/34/". Se ejecutará la función ``detail()`` y nos mostrará el ID que pasamos en la URL. Probemos también "/polls/34/results/" y "/polls/34/vote/" -- esto nos debería mostrar los placeholder que definimos para las páginas de resultados y para votar.

source: When somebody requests a page from your Web site -- say, "/polls/34/", Django will load the ``mysite.urls`` Python module because it's pointed to by the :setting:`ROOT_URLCONF` setting. It finds the variable named ``urlpatterns`` and traverses the regular expressions in order. The :func:`~django.conf.urls.include` functions we are using simply reference other URLconfs. Note that the regular expressions for the :func:`~django.conf.urls.include` functions don't have a ``$`` (end-of-string match character) but rather a trailing slash. Whenever Django encounters :func:`~django.conf.urls.include`, it chops off whatever part of the URL matched up to that point and sends the remaining string to the included URLconf for further processing.
es: Cuando alguien pide por una página de nuestro sitio -- supongamos "/polls/34/", Django va a cargar el módulo ``mysite.urls``, al que apunta el setting :setting:`ROOT_URLCONF`. Encuentra la variable ``urlpatterns`` y recorre las expresiones regulares en orden. Las llamadas a :func:`~django.conf.urls.include` simplemente referencian otros URLconf. Notar que las expresiones regulares para los :func:`~django.conf.urls.include` no tienen un ``$`` (caracter que indica el fin de string en un patrón), sino que terminan en una barra. Cada vez que Django encuentra un :func:`~django.conf.urls.include`, recorta la parte de la URL que coincide hasta ese punto y envía el string restante al URLconf relacionado para continuar el proceso.

source: The idea behind :func:`~django.conf.urls.include` is to make it easy to plug-and-play URLs. Since polls are in their own URLconf (``polls/urls.py``), they can be placed under "/polls/", or under "/fun_polls/", or under "/content/polls/", or any other path root, and the app will still work.
es: La idea detrás de :func:`~django.conf.urls.include` es hacer fácil tener URLs plug-and-play. Como polls tiene su propio URLconf (``polls/urls.py``), las URLs de la app se pueden poner bajo "/polls/", o bajo "/fun_polls/", o bajo "/content/polls/", o cualquier otro camino, y la app seguirá funcionando.

source: Here's what happens if a user goes to "/polls/34/" in this system:
es: Esto es lo que pasa si un usuario va a "/polls/34/" en este sistema:

source: Django will find the match at ``'^polls/'``
es: Django encontrará coincidencia en ``'^polls/'``

source: Then, Django will strip off the matching text (``"polls/"``) and send the remaining text -- ``"34/"`` -- to the 'polls.urls' URLconf for further processing which matches ``r'^(?P<question_id>[0-9]+)/$'`` resulting in a call to the ``detail()`` view like so::
es: Entonces, Django va a recortar el texto que coincide (``"polls/"``) y enviar el texto restante -- ``"34/"`` -- al URLconf 'polls.urls' para seguir el proceso, donde coincidirá con ``r'^(?P<question_id>[0-9]+)/$'``, resultando en una llamada a la view ``detail()`` de la forma::

source: The ``question_id='34'`` part comes from ``(?P<question_id>[0-9]+)``. Using parentheses around a pattern "captures" the text matched by that pattern and sends it as an argument to the view function; ``?P<question_id>`` defines the name that will be used to identify the matched pattern; and ``[0-9]+`` is a regular expression to match a sequence of digits (i.e., a number).
es: La parte ``question_id='34'`` surge de ``(?P<question_id>[0-9]+)``. Usando paréntesis alrededor de un patrón se "captura" el texto que coincida con el patrón y ese valor se pasas como argumento a la función view; ``?P<question_id>`` define el nombre que se usará para identificar la coincidencia; y ``[0-9]+`` es una expresión regular para buscar una secuencia de dígitos (i.e., un número).

source: Because the URL patterns are regular expressions, there really is no limit on what you can do with them. And there's no need to add URL cruft such as ``.html`` -- unless you want to, in which case you can do something like this::
es: Como los patrones de URL son expresiones regulares, no hay realmente un límite de lo que se puede hacer con ellos. Y no hay necesidad de agregar cosas como ``.html`` -- a menos que uno quisiera, en cuyo caso nos quedaría algo como::

source: But, don't do that. It's silly.
es: Pero no hagan esto. No tiene sentido.

source: Write views that actually do something
es: Escribiendo views que hacen algo

source: Each view is responsible for doing one of two things: returning an :class:`~django.http.HttpResponse` object containing the content for the requested page, or raising an exception such as :exc:`~django.http.Http404`. The rest is up to you.
es: Cada view es responsable de hacer una de dos cosas: devolver un objeto :class:`~django.http.HttpResponse` con el contenido de la página solicitada, o levantar una excepción, por ejemplo :exc:`~django.http.Http404`. El resto depende de uno.

source: Your view can read records from a database, or not. It can use a template system such as Django's -- or a third-party Python template system -- or not. It can generate a PDF file, output XML, create a ZIP file on the fly, anything you want, using whatever Python libraries you want.
es: Una view puede leer registros de una base de datos, o no. Puede usar un sistema de templates como el de Django -- o algún otro basado en Python --, o no. Puede generar un archivo PDF, una salida XML, crear un archivo ZIP, cualquier cosa que uno quiera, usando cualquier librería Python que uno quiera.

source: All Django wants is that :class:`~django.http.HttpResponse`. Or an exception.
es: Todo lo que Django espera es un :class:`~django.http.HttpResponse`. O una excepción.

source: Because it's convenient, let's use Django's own database API, which we covered in :doc:`Tutorial 1 </intro/tutorial01>`. Here's one stab at a new ``index()`` view, which displays the latest 5 poll questions in the system, separated by commas, according to publication date:
es: Por ser conveniente, vamos a usar la API de Django para base de datos, que vimos en el :doc:`Tutorial 1 </intro/tutorial01>`. Aquí tenemos una aproximación a la view ``index()`` que muestra las 5 preguntas más recientes en el sistema, separadas por comas, de acuerdo a la fecha de publicación:

source: There's a problem here, though: the page's design is hard-coded in the view. If you want to change the way the page looks, you'll have to edit this Python code. So let's use Django's template system to separate the design from Python by creating a template that the view can use.
es: Pero tenemos un problema: el diseño de la página está escrito explícitamente en la view. Si uno quisiera cambiar cómo se ve la página, debería editar el código Python. Entonces vamos a usar el sistema de templates de Django para separar el diseño del código Python, creando un template que la view pueda usar.

source: First, create a directory called ``templates`` in your ``polls`` directory. Django will look for templates in there.
es: Primero, creamos un directorio llamado ``templates`` en nuestro directorio ``polls``. Django va a buscar los templates allí.

source: Your project's :setting:`TEMPLATES` setting describes how Django will load and render templates. The default settings file configures a ``DjangoTemplates`` backend whose :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` option is set to ``True``. By convention ``DjangoTemplates`` looks for a "templates" subdirectory in each of the :setting:`INSTALLED_APPS`. This is how Django knows to find the polls templates even though we didn't modify the :setting:`DIRS <TEMPLATES-DIRS>` option, as we did in :ref:`Tutorial 2 <ref-customizing-your-projects-templates>`.
es: El setting :setting:`TEMPLATES` de nuestro proyecto describe cómo Django va a cargar y renderizar templates. Por defecto se configura como backend ``DjangoTemplates``, con la opción :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` en True. Por convención ``DjangoTemplates`` busca por un subdirectorio "templates" en cada una de las aplicaciones en :setting:`INSTALLED_APPS`. Esta es la manera en que Django sabe encontrar los templates de nuestra aplicación polls sin tener que modificar la opción :setting:`DIRS <TEMPLATES-DIRS>`, como hicimos en :ref:`Tutorial 2 <ref-customizing-your-projects-templates>`.

source: Organizing templates
es: Organizando los templates

source: We *could* have all our templates together, in one big templates directory, and it would work perfectly well. However, this template belongs to the polls application, so unlike the admin template we created in the previous tutorial, we'll put this one in the application's template directory (``polls/templates``) rather than the project's (``templates``). We'll discuss in more detail in the :doc:`reusable apps tutorial </intro/reusable-apps>` *why* we do this.
es: *Podríamos* tener todos nuestros templates juntos, en un gran directorio templates y funcionaría perfectamente bien. Sin embargo, este template pertenece a la aplicación polls entonces, a diferencia del template del admin que creamos en la parte anterior, vamos a poner este en el directorio de templates de la aplicación (``polls/templates``) en lugar de aquel del proyecto (``templates``). Discutiremos más en detalle en :doc:`el tutorial de apps reusables </intro/reusable-apps>` el *por qué* de esto.

source: Within the ``templates`` directory you have just created, create another directory called ``polls``, and within that create a file called ``index.html``. In other words, your template should be at ``polls/templates/polls/index.html``. Because of how the ``app_directories`` template loader works as described above, you can refer to this template within Django simply as ``polls/index.html``.
es: En el directorio ``templates`` que acabamos de crear, creamos otro directorio llamado ``polls``, y allí creamos un archivo ``index.html``. En otras palabras, nuestro template debería estar en ``polls/templates/polls/index.html``. Como la carga de templates basada en ``app_directories`` funciona como se describió arriba, nos podemos referir a este template en Django simplemente como ``polls/index.html``.

source: Template namespacing
es: Espacio de nombre en templates

source: Now we *might* be able to get away with putting our templates directly in ``polls/templates`` (rather than creating another ``polls`` subdirectory), but it would actually be a bad idea. Django will choose the first template it finds whose name matches, and if you had a template with the same name in a *different* application, Django would be unable to distinguish between them. We need to be able to point Django at the right one, and the easiest way to ensure this is by *namespacing* them. That is, by putting those templates inside *another* directory named for the application itself.
es: Ahora *podríamos* continuar poniendo nuestros templates directamente en ``polls/templates`` (en lugar de crear otro subdirectorio ``polls``), pero no sería una buena idea. Django elegirá el primer template que encuentre tal que el nombre coincida, y si tenemos un template con el mismo nombre en una aplicación *diferente*, Django no podrá distinguir entre ellos. Necesitamos apuntar a Django al correcto, y la forma más fácil de asegurarse de esto es usando *espacio de nombres* para ellos. Esto es, poner los templates dentro de *otro* directorio llamado como la aplicación correspondiente.

source: Put the following code in that template:
es: Pongamos el siguiente código en ese template:

source: Now let's update our ``index`` view in ``polls/views.py`` to use the template:
es: Ahora actualicemos nuestra view ``index`` en ``polls/views.py`` para usar el template:
