Repository: igorrocha/django-tutorial
Catalog: locale/*/LC_MESSAGES/intro.po
Languages: es

source: Let's convert our poll app to use the generic views system, so we can delete a bunch of our own code. We'll just have to take a few steps to make the conversion. We will:
es: Vamos a convertir nuestra app para usar views genéricas, y poder borrar parte de nuestro código original. Son solamente unos pocos pasos:

source: Convert the URLconf.
es: Convertir el URLconf.

source: Delete some of the old, unneeded views.
es: Borrar algunas de las views que teníamos, ya no necesarias.

source: Introduce new views based on Django's generic views.
es: Arreglar el manejo de URL para las nuevas views.

source: Read on for details.
es: Para más detalles, seguir leyendo.

source: Why the code-shuffle?
es: Por qué cambiar nuestro código?

source: Generally, when writing a Django app, you'll evaluate whether generic views are a good fit for your problem, and you'll use them from the beginning, rather than refactoring your code halfway through. But this tutorial intentionally has focused on writing the views "the hard way" until now, to focus on core concepts.
es: Generalmente, cuando uno escribe una app Django, evaluará si usar views genéricas es una buena solución para el problema en cuestión, y las utilizará desde el comienzo, en lugar de refactorear el código a mitad de camino. Este tutorial intencionalmente se centró en escribir views "sin ayuda" hasta ahora, para aprender los conceptos principales.

source: You should know basic math before you start using a calculator.
es: Uno debería aprender matemática básica antes de empezar a usar una calculadora.

source: Amend URLconf
es: Arreglando URLconf

source: First, open the ``polls/urls.py`` URLconf and change it like so:
es: Primero, abrimos el URLconf ``polls/urls.py`` y lo cambiamos de la siguiente manera:

source: Note that the name of the matched pattern in the regexes of the second and third patterns has changed from ``<question_id>`` to ``<pk>``.
es: Notar que el nombre del patrón que se busca en las segunda y tercera expresiones regulares cambió de ``<question_id>`` a ``<pk>``.

source: Amend views
es: Arreglando views

source: Next, we're going to remove our old ``index``, ``detail``, and ``results`` views and use Django's generic views instead. To do so, open the ``polls/views.py`` file and change it like so:
es: A continuación vamos a borrar nuestras viejas views ``index``, ``detail``, y ``results`` para usar las generic views de Django en vez. Para ello, abrimos el archivo ``polls/views.py`` y cambiamos:

source: We're using two generic views here: :class:`~django.views.generic.list.ListView` and :class:`~django.views.generic.detail.DetailView`. Respectively, those two views abstract the concepts of "display a list of objects" and "display a detail page for a particular type of object."
es: Estamos usando dos views genéricas: :class:`~django.views.generic.list.ListView` y :class:`~django.views.generic.detail.DetailView`. Estas dos views nos abstraen de los conceptos de "mostrar una lista de objetos" y "mostrar el detalle de un objeto particular", respectivamente.

source: Each generic view needs to know what model it will be acting upon. This is provided using the ``model`` attribute.
es: Cada view genérica necesita saber sobre qué modelo actuar. Esto se define usando el atributo ``model``.

source: The :class:`~django.views.generic.detail.DetailView` generic view expects the primary key value captured from the URL to be called ``"pk"``, so we've changed ``question_id`` to ``pk`` for the generic views.
es: La view genérica :class:`~django.views.generic.detail.DetailView` espera el valor de clave primaria capturado de la URL con nombre ``\"pk\"``, entonces cambiamos ``question_id`` a ``pk``.

source: By default, the :class:`~django.views.generic.detail.DetailView` generic view uses a template called ``<app name>/<model name>_detail.html``. In our case, it would use the template ``"polls/question_detail.html"``. The ``template_name`` attribute is used to tell Django to use a specific template name instead of the autogenerated default template name. We also specify the ``template_name`` for the ``results`` list view -- this ensures that the results view and the detail view have a different appearance when rendered, even though they're both a :class:`~django.views.generic.detail.DetailView` behind the scenes.
es: Por defecto, la view genérica :class:`~django.views.generic.detail.DetailView` usa un template llamado ``<app name>/<model name>_detail.html``. En nuestro caso, usará el template ``"polls/question_detail.html"``. El argumento ``template_name`` es usado para indicarle a Django que use un template de nombre específico en lugar de usar el nombre de template autogenerado por defecto. También especificamos ``template_name`` para la view ``results`` -- esto nos asegura que la view de resultados y la de detalle tiene un aspecto diferente al renderizarse, aún cuando ambas usan :class:`~django.views.generic.detail.DetailView` por detrás.

source: Similarly, the :class:`~django.views.generic.list.ListView` generic view uses a default template called ``<app name>/<model name>_list.html``; we use ``template_name`` to tell :class:`~django.views.generic.list.ListView` to use our existing ``"polls/index.html"`` template.
es: De forma similar, la view genérica :class:`~django.views.generic.list.ListView` usa un template por defecto llamado ``<app name>/<model name>_list.html``; usamos ``template_name`` para indicarle a :class:`~django.views.generic.list.ListView` que use el template ya existente ``"polls/index.html"``.

source: In previous parts of the tutorial, the templates have been provided with a context that contains the ``question`` and ``latest_question_list`` context variables. For ``DetailView`` the ``question`` variable is provided automatically -- since we're using a Django model (``Question``), Django is able to determine an appropriate name for the context variable. However, for ListView, the automatically generated context variable is ``question_list``. To override this we provide the ``context_object_name`` attribute, specifying that we want to use ``latest_question_list`` instead. As an alternative approach, you could change your templates to match the new default context variables -- but it's a lot easier to just tell Django to use the variable you want.
es: En partes anteriores de este tutorial, los templates recibían un contexto que contenía las variables ``question`` y ``latest_question_list``. Para ``DetailView`` la variable ``question`` es provista automáticamente -- como estamos usando un modelo Django (``Question``), Django puede determinar un nombre adecuado para la variable de contexto. Sin embargo, para ListView, el nombre de variable de contexto generado automáticamente es ``question_list``. Para sobreescribir este valor, pasamos la opción ``context_object_name``, especificando que queremos usar ``latest_question_list`` como nombre. Otra alternativa sería cambiar los templates para adecuarlos a los nombres por defecto -- pero es mucho más fácil decirle a Django que use el nombre de variable que queremos.

source: Run the server, and use your new polling app based on generic views.
es: Corremos el servidor, y usamos nuestra app, ahora basada en views genéricas.

source: For full details on generic views, see the `generic views documentation <https://docs.djangoproject.com/en/1.8/topics/class-based-views/index>`_.
es: Para más detalles sobre views genéricas, se puede ver la `documentación sobre views genéricas <https://docs.djangoproject.com/en/1.8/topics/class-based-views/index>`_.

source: When you're comfortable with forms and generic views, read :doc:`part 5 of this tutorial </intro/tutorial05>` to learn about testing our polls app.
es: Una vez que estés cómodo con forms y views genéricas, podés leer la :doc:`parte 5 de este tutorial </intro/tutorial05>` para aprender sobre cómo testear nuestra app de preguntas.

source: Writing your first Django app, part 5
es: Escribiendo tu primera Django app, parte 5
