Repository: igorrocha/django-tutorial
Catalog: locale/*/LC_MESSAGES/intro.po
Languages: es

source: And speaking of forms with dozens of fields, you might want to split the form up into fieldsets:
es: Y hablando de forms con docenas de campos, podríamos querer dividir el form en fieldsets:

source: The first element of each tuple in :attr:`~django.contrib.admin.ModelAdmin.fieldsets` is the title of the fieldset. Here's what our form looks like now:
es: El primer argumento de cada tupla en :attr:`~django.contrib.admin.ModelAdmin.fieldsets` es el título del fieldset. Ahora nuestro form se vería así:

source: You can assign arbitrary HTML classes to each fieldset. Django provides a ``"collapse"`` class that displays a particular fieldset initially collapsed. This is useful when you have a long form that contains a number of fields that aren't commonly used:
es: Podemos asignar clases HTML arbitrarias a cada fieldset. Django provee una clase ``"collapse"`` que muestra el fieldset inicialmente plegado. Esto es útil cuando uno tiene un form largo que contiene ciertos campos que no se usan normalmente:

source: Adding related objects
es: Agregando objetos relacionados

source: OK, we have our Question admin page. But a ``Question`` has multiple ``Choices``, and the admin page doesn't display choices.
es: OK, tenemos nuestra página de admin para el modelo Question. Pero un objeto ``Question`` tiene múltiple ``Choices``, y la página de admin no nos muestra estas opciones.

source: Yet.
es: Todavía.

source: There are two ways to solve this problem. The first is to register ``Choice`` with the admin just as we did with ``Question``. That's easy:
es: Hay dos formas de resolver este problema. La primera es registrar ``Choice`` con el admin como hicimos con ``Question``. Esto es fácil:

source: Now "Choices" is an available option in the Django admin. The "Add choice" form looks like this:
es: Ahora "Choices" está disponible en el admin de Django. El form de "Add choice" se vería como esto:

source: In that form, the "Question" field is a select box containing every question in the database. Django knows that a :class:`~django.db.models.ForeignKey` should be represented in the admin as a ``<select>`` box. In our case, only one question exists at this point.
es: En ese form, el campo "Question" es un desplegable que contiene todas las encuestas en la base de datos. Django sabe que un :class:`~django.db.models.ForeignKey` debe mostrarse como un ``<select>`` en el admin. En nuestro caso, existe solamente una encuesta en este momento.

source: Also note the "Add Another" link next to "Question." Every object with a ``ForeignKey`` relationship to another gets this for free. When you click "Add Another," you'll get a popup window with the "Add question" form. If you add a question in that window and click "Save," Django will save the question to the database and dynamically add it as the selected choice on the "Add choice" form you're looking at.
es: Notemos también el link "Add Another" al lado de "Question". Todo objeto con una relación de ``ForeignKey`` a otro tiene esta opción, gratis. Cuando uno hace click en "Add Another", se obtiene un popup con el form de "Add question". Si uno agrega una pregunta mediante este form y hace click en "Save", Django va a guardar la pregunta en la base de datos y dinámicamente seleccionarla como valor en el form de "Add choice" que estábamos viendo.

source: But, really, this is an inefficient way of adding ``Choice`` objects to the system. It'd be better if you could add a bunch of Choices directly when you create the ``Question`` object. Let's make that happen.
es: Pero, la verdad, esta es una manera ineficiente de agregar objetos ``Choice`` al sistema. Sería mejor su uno pudiera agregar varias Choices directamente cuando se crea un objeto ``Question``. Hagamos que eso ocurra.

source: Remove the ``register()`` call for the ``Choice`` model. Then, edit the ``Question`` registration code to read:
es: Borramos la llamada a ``register()`` para el modelo ``Choice``. Editamos el código que registra ``Question`` para que se vea así:

source: This tells Django: "``Choice`` objects are edited on the ``Question`` admin page. By default, provide enough fields for 3 choices."
es: Esto le dice a Django: "los objetos ``Choice`` se editan en la página de admin de ``Question``. Por defecto, proveer los campos para 3 choices".

source: Load the "Add question" page to see how that looks:
es: Cargamos la página de "Add question" para ver cómo se ve:

source: It works like this: There are three slots for related Choices -- as specified by ``extra`` -- and each time you come back to the "Change" page for an already-created object, you get another three extra slots.
es: Funciona así: hay 3 slots para Choices relacionados -- como especifica ``extra`` -- y cada vez que uno vuelve a la página de "Change" para un objeto ya creado, se muestran otros 3 slots extra.

source: At the end of the three current slots you will find an "Add another Choice" link. If you click on it, a new slot will be added. If you want to remove the added slot, you can click on the X to the top right of the added slot. Note that you can't remove the original three slots. This image shows an added slot:
es: Al final de los 3 slots actuales se encuentra un link para agregar una nueva Choice ("Add another Choice"). Si se hace click en el mismo, se agrega un nuevo slot. Si uno quisiera borar uno de los slots agregados, se puede hacer click en la X en la esquina superior derecha del slot. Notar que no se puede borrar de esta manera los slots originales. Esta imagen muestra un slot agregado como se describió:

source: One small problem, though. It takes a lot of screen space to display all the fields for entering related ``Choice`` objects. For that reason, Django offers a tabular way of displaying inline related objects; you just need to change the ``ChoiceInline`` declaration to read:
es: Un pequeño problema. Ocupa mucho espacio en pantalla mostrar todos los campos para ingresar los objetos ``Choice`` relacionados. Por esa razón, Django ofrece una forma tabular para mostrar objetos relacionados "inline"; solamente necesitamos cambiar la declaración de ``ChoiceInline`` de esta manera:

source: With that ``TabularInline`` (instead of ``StackedInline``), the related objects are displayed in a more compact, table-based format:
es: Con ``TabularInline`` (en lugar de ``StackedInline``), los objetos relacionados se muestran de forma más compacta, en forma de tabla:

source: Note that there is an extra "Delete?" column that allows removing rows added using the "Add Another Choice" button and rows that have already been saved.
es: Notemos que hay una columna extra con la opción "Delete?" que nos permite borrar filas que hayamos agregado usando el botón "Add Another Choice" y filas que ya hayan sido guardadas.

source: Customize the admin change list
es: Personalizar la página listado

source: Now that the Question admin page is looking good, let's make some tweaks to the "change list" page -- the one that displays all the questions in the system.
es: Ahora que la página de admin de Question se ve bien, hagamos algunos tweaks a la página de listado -- la que lista todas las preguntas en el sistema.

source: Here's what it looks like at this point:
es: Así se ve ahora:

source: By default, Django displays the ``str()`` of each object. But sometimes it'd be more helpful if we could display individual fields. To do that, use the :attr:`~django.contrib.admin.ModelAdmin.list_display` admin option, which is a tuple of field names to display, as columns, on the change list page for the object:
es: Por defecto, Django muestra el ``str()`` de cada objeto. Pero algunas veces es más útil si podemos mostrar campos individuales. Para eso usamos la opción :attr:`~django.contrib.admin.ModelAdmin.list_display` del admin, que es una tupla de los nombres de campo a mostrar, como columnas, en la página de listado:

source: Just for good measure, let's also include the ``was_published_recently`` custom method from Tutorial 1:
es: Sólo por si acaso, incluyamos también el método ``was_published_recently`` que definimos en la primera parte:

source: Now the question change list page looks like this:
es: Ahora la página de listado de encuestas se vería así:

source: You can click on the column headers to sort by those values -- except in the case of the ``was_published_recently`` header, because sorting by the output of an arbitrary method is not supported. Also note that the column header for ``was_published_recently`` is, by default, the name of the method (with underscores replaced with spaces), and that each line contains the string representation of the output.
es: Podemos hacer click en los encabezados de las columnas para ordenar por los respectivos valores -- salvo en el caso de ``was_published_recently``, porque ordenar por la salida de un método arbitrario no está soportado. Notemos también que el encabezado para la columna de ``was_published_recently`` es por defecto el nombre del método (reemplazando guiones bajos por espacios), y que cada línea contiene la representación como string del valor devuelto por el método.

source: You can improve that by giving that method (in :file:`polls/models.py`) a few attributes, as follows:
es: Esto se puede mejorar definiendo un par de atributos del método (en :file:`polls/models.py`) como sigue:

source: For more information on these method properties, see :attr:`~django.contrib.admin.ModelAdmin.list_display`.
es: Para más información sobre estas propiedades, ver :attr:`~django.contrib.admin.ModelAdmin.list_display`.

source: Edit your :file:`polls/admin.py` file again and add an improvement to the ``Question`` change list page: filters using the :attr:`~django.contrib.admin.ModelAdmin.list_filter`. Add the following line to ``QuestionAdmin``::
es: Editamos el archivo :file:`polls/admin.py` de nuevo y agregamos una mejora a la página de listado de preguntas: filtros usando :attr:`~django.contrib.admin.ModelAdmin.list_filter`. Agregamos la siguiente línea a ``QuestionAdmin``:

source: That adds a "Filter" sidebar that lets people filter the change list by the ``pub_date`` field:
es: Esto agrega un "Filtro" en la barra lateral que permite filtrar el listado por el campo ``pub_date``:

source: The type of filter displayed depends on the type of field you're filtering on. Because ``pub_date`` is a :class:`~django.db.models.DateTimeField`, Django knows to give appropriate filter options: "Any date," "Today," "Past 7 days," "This month," "This year."
es: El tipo de filtro depende del tipo de campo sobre el cual se filtra. Como ``pub_date`` es un :class:`~django.db.models.DateTimeField`, Django sabe darnos opciones de filtro apropiadas: "Any date", "Today", "Past 7 days", "This month", "This year".

source: This is shaping up well. Let's add some search capability::
es: Esto está tomando buena forma. Agreguemos campacidad de búsqueda:

source: That adds a search box at the top of the change list. When somebody enters search terms, Django will search the ``question_text`` field. You can use as many fields as you'd like -- although because it uses a ``LIKE`` query behind the scenes, limiting the number of search fields to a reasonable number will make it easier for your database to do the search.
es: Esto agrega un campo de búsqueda al tope del listado. Cuando alguien ingresa términos de búsqueda, Django va a buscar sobre el campo ``question_text``. Se pueden usar tantos campos como uno quiera -- aunque como por detrás se trata de una consulta del tipo ``LIKE`` hay que ser razonables para hacérselo simple a la base de datos.

source: Now's also a good time to note that change lists give you free pagination. The default is to display 100 items per page. :attr:`Change list pagination <django.contrib.admin.ModelAdmin.list_per_page>`, :attr:`search boxes <django.contrib.admin.ModelAdmin.search_fields>`, :attr:`filters <django.contrib.admin.ModelAdmin.list_filter>`, :attr:`date-hierarchies <django.contrib.admin.ModelAdmin.date_hierarchy>`, and :attr:`column-header-ordering <django.contrib.admin.ModelAdmin.list_display>` all work together like you think they should.
es: Es un buen momento para observar también que el listado es paginado. Por defecto se muestran 100 items por página. :attr:`Paginación <django.contrib.admin.ModelAdmin.list_per_page>`, :attr:`búsqueda <django.contrib.admin.ModelAdmin.search_fields>`, :attr:`filtros <django.contrib.admin.ModelAdmin.list_filter>`, :attr:`jerarquía de fechas <django.contrib.admin.ModelAdmin.date_hierarchy>`, y :attr:`ordenamiento desde columnas <django.contrib.admin.ModelAdmin.list_display>` funcionan como uno esperaría.

source: Customize the admin look and feel
es: Personalizar el "look and feel" del admin

source: Clearly, having "Django administration" at the top of each admin page is ridiculous. It's just placeholder text.
es: Claramente tener el título "Django administration" al tope de cada página del admin es ridículo. Es un "placeholder".

source: That's easy to change, though, using Django's template system. The Django admin is powered by Django itself, and its interfaces use Django's own template system.
es: Es fácil de cambiar usando el sistema de templates de Django. El admin de Django funciona gracias a Django mismo, y la interfaz provista usa el sistema de templates de Django.

source: Customizing your *project's* templates
es: Personalizando los templates de tu *proyecto*

source: Create a ``templates`` directory in your project directory (the one that contains ``manage.py``). Templates can live anywhere on your filesystem that Django can access. (Django runs as whatever user your server runs.) However, keeping your templates within the project is a good convention to follow.
es: Creamos un directorio ``templates`` en el directorio del proyecto (el que contiene ``manage.py``). Los templates pueden estar en cualquier lugar de nuestro sistema de archivos al que Django tenga acceso (Django corre como el usuario que corra el servidor). Sin embargo, mantener los templates dentro del proyecto es una buena convención a seguir.

source: Open your settings file (:file:`mysite/settings.py`, remember) and add a :setting:`DIRS <TEMPLATES-DIRS>` option in the :setting:`TEMPLATES` setting:
es: Abrimos el archivo de settings (recordemos, ``mysite/settings.py``) y agregamos la opción :setting:`DIRS <TEMPLATE-DIRS>` en el setting :setting:`TEMPLATES`:

source: :setting:`DIRS <TEMPLATES-DIRS>` is a list of filesystem directories to check when loading Django templates; it's a search path.
es: :setting:`DIRS <TEMPLATES-DIRS>` es una lista de directorios en los que Django chequea para cargar templates; es un path de búsqueda.

source: Now create a directory called ``admin`` inside ``templates``, and copy the template ``admin/base_site.html`` from within the default Django admin template directory in the source code of Django itself (``django/contrib/admin/templates``) into that directory.
es: Ahora creamos un directorio llamado ``admin`` dentro de ``templates``, y copiamos el template ``admin/base_site.html`` del directorio de templates del admin de Django por defecto, del código fuente de Django mismo (``django/contrib/admin/templates``), a ese directorio.

source: Where are the Django source files?
es: Dónde están los archivos del código fuente de Django?

source: If you have difficulty finding where the Django source files are located on your system, run the following command:
es: Si tenés problemas encontrando dónde están los archivos de Django, podés correr el siguiente comando:

source: Then, just edit the file and replace ``{{ site_header|default:_('Django administration') }}`` (including the curly braces) with your own site's name as you see fit. You should end up with a section of code like:
es: Luego, basta editar el archivo y reemplazar ``{{ site_header|default:_('Django administration') }}`` (incluyendo las llaves) por el nombre de nuestro sitio. Deberías terminar con una sección de código como:

source: We use this approach to teach you how to override templates. In an actual project, you would probably use the :attr:`django.contrib.admin.AdminSite.site_header` attribute to more easily make this particular customization.
es: Usamos esta metodología para enseñarte la manera en que se personalizan templates. En un proyecto real, probablemente usaríamos el atributo :attr:`django.contrib.admin.AdminSite.site_header` para cambiar este valor en particular.

source: This template file contains lots of text like ``{% block branding %}`` and ``{{ title }}``. The ``{%`` and ``{{`` tags are part of Django's template language. When Django renders ``admin/base_site.html``, this template language will be evaluated to produce the final HTML page. Don't worry if you can't make any sense of the template right now -- we'll delve into Django's templating language in Tutorial 3.
es: Este archivo de template contiene varios textos de la forma ``{% block branding %}`` y and ``{{ title }}``. Los tags ``{%`` y ``{{`` son parte del lenguaje de templates de Django. Cuando Django renderiza ``admin/base_site.html``, este lenguaje se evalúa para producir la página HTML final. No nos preocupemos de esto por ahora -- veremos en detalle el lenguaje de templates de Django en Tutorial 3.

source: Note that any of Django's default admin templates can be overridden. To override a template, just do the same thing you did with ``base_site.html`` -- copy it from the default directory into your custom directory, and make changes.
es: Notemos que cualquier template del admin de Django se puede "sobreescribir". Para esto sólo basta repetir lo que hicimos con ``base_site.html`` -- copiar el template desde el directorio de Django a nuestro directorio de templates y aplicar los cambios.

source: Customizing your *application's* templates
es: Personalizando los templates de tu *aplicación*

source: Astute readers will ask: But if :setting:`DIRS <TEMPLATES-DIRS>` was empty by default, how was Django finding the default admin templates? The answer is that, since :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` is set to ``True``, Django automatically looks for a ``templates/`` subdirectory within each application package, for use as a fallback (don't forget that ``django.contrib.admin`` is an application).
es: Los lectores astutos se estarán preguntando: si :setting:`DIRS <TEMPLATES-DIRS>` estaba vacío por defecto, cómo es que Django encuentra los templates del admin? La respuesta es que, como :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` está seteado en ``True``, Django automáticamente busca un subdirectorio ``templates/`` en cada paquete de aplicación, para usar como fallback (no olvidarse que ``django.contrib.admin`` es una aplicación).

source: Our poll application is not very complex and doesn't need custom admin templates. But if it grew more sophisticated and required modification of Django's standard admin templates for some of its functionality, it would be more sensible to modify the *application's* templates, rather than those in the *project*. That way, you could include the polls application in any new project and be assured that it would find the custom templates it needed.
es: Nuestra aplicación no es muy compleja y no necesita personalizar templates del admin. Pero si creciera de forma más sofisticada y requiriera cambios a los templates base del admin para alguna funcionalidad, sería más razonable modificar los templates a nivel *aplicación* en lugar de *proyecto*. De esta manera, se podría incluir la aplicación ``polls`` en cualquier nuevo proyecto y asegurarse de que los templates personalizados estuvieran disponibles.

source: See the `template loading documentation <https://docs.djangoproject.com/en/1.8/topics/templates/#template-loading>`_ for more information about how Django finds its templates.
es: Ver la `documentación de carga de templates <https://docs.djangoproject.com/en/1.8/topics/templates/#template-loading>`_ para más información sobre cómo Django busca los templates.

source: Customize the admin index page
es: Personalizar la página inicial del admin

source: On a similar note, you might want to customize the look and feel of the Django admin index page.
es: De forma similar uno podría querer personalizar el look and feel de la página inicial del admin.

source: By default, it displays all the apps in :setting:`INSTALLED_APPS` that have been registered with the admin application, in alphabetical order. You may want to make significant changes to the layout. After all, the index is probably the most important page of the admin, and it should be easy to use.
es: Por defecto, muestra todas las apps en :setting:`INSTALLED_APPS` que se registraron con la aplicación admin, en orden alfabético. Uno podría querer hacer cambios significativos al layout. Después de todo, la inicial es probablemente la página más importante del admin, y debería ser fácil de usar.

source: The template to customize is ``admin/index.html``. (Do the same as with ``admin/base_site.html`` in the previous section -- copy it from the default directory to your custom template directory.) Edit the file, and you'll see it uses a template variable called ``app_list``. That variable contains every installed Django app. Instead of using that, you can hard-code links to object-specific admin pages in whatever way you think is best. Again, don't worry if you can't understand the template language -- we'll cover that in more detail in Tutorial 3.
es: El template a personalizar es ``admin/index.html`` (habría que hacer lo mismo que hicimos en la sección anterior con ``admin/base_site.html`` -- copiar el template a nuestro directorio de templates). Editamos el archivo, y veremos que usa una variable de template llamada ``app_list``. Esta variable contiene cada app instalada. En lugar de usarla, uno podría escribir los links de manera explícita a las páginas de objetos específicas del admin de la manera en que a uno le parezca mejor. De nuevo, no preocuparse si no se entiende el lenguaje de templates -- lo cubriremos en detalle en Tutorial 3.

source: When you're comfortable with the admin site, read :doc:`part 3 of this tutorial </intro/tutorial03>` to start working on public poll views.
es: Una vez que te sientas cómodo con el sitio de admin, podés empezar con la :doc:`parte 3 del tutorial </intro/tutorial03>` donde comenzamos a trabajar con las vistas públicas de nuestra aplicación.

source: Writing your first Django app, part 3
es: Escribiendo tu primera Django app, parte 3

source: This tutorial begins where :doc:`Tutorial 2 </intro/tutorial02>` left off. We're continuing the Web-poll application and will focus on creating the public interface -- "views."
es: Este tutorial empieza donde quedó el :doc:`Tutorial 2 </intro/tutorial02>`. Continuamos con la aplicación web de preguntas y nos concentraremos en la creación de la interfaz pública -- "views".

source: A view is a "type" of Web page in your Django application that generally serves a specific function and has a specific template. For example, in a blog application, you might have the following views:
es: Una view es un "tipo" de página web en nuestra aplicación Django que generalmente provee una función específica y tiene un template particular. Por ejemplo, en una aplicación de blog, uno podría tener las siguientes views:

source: Blog homepage -- displays the latest few entries.
es: Blog homepage -- muestra las últimas entradas.

source: Entry "detail" page -- permalink page for a single entry.
es: Detalle de una entrada -- página correspondiente a una entrada o post.

source: Year-based archive page -- displays all months with entries in the given year.
es: Archivo anual -- muestra los meses de una año con sus correspondientes entradas.
