Repository: igorrocha/django-tutorial
Catalog: locale/*/LC_MESSAGES/intro.po
Languages: es

source: Writing your first patch for Django
es: Escribiendo tu primer parche para Django

source: Introduction
es: Introducción

source: Interested in giving back to the community a little? Maybe you've found a bug in Django that you'd like to see fixed, or maybe there's a small feature you want added.
es: Interesado en devolver algo a la comunidad? Quizás hayas encontrado un bug en Django que te gustaría ver arreglado, o quizás hay alguna funcionalidad que te gustaría ver incorporada.

source: Contributing back to Django itself is the best way to see your own concerns addressed. This may seem daunting at first, but it's really pretty simple. We'll walk you through the entire process, so you can learn by example.
es: Constribuir con Django es la mejor manera de ver nuestras preocupaciones tenidas en cuenta. Puede parece intimidante al principio, pero es realmente simple. Vamos a recorrer el proceso completo para aprender mediante un ejemplo.

source: Who's this tutorial for?
es: Para quién es este tutorial?

source: For this tutorial, we expect that you have at least a basic understanding of how Django works. This means you should be comfortable going through the existing tutorials on :doc:`writing your first Django app </intro/tutorial01>`. In addition, you should have a good understanding of Python itself. But if you don't, `Dive Into Python`__ is a fantastic (and free) online book for beginning Python programmers.
es: Para este tutorial esperamos que tengas al menos un conocimiento básico sobre cómo funciona Django. Esto significa que deberías estar cómodo recorriendo los tutoriales existentes, :doc:`Escribiendo tu primera Django app <tutorial01>`. Además, deberías tener una buena base de Python. Si no es el caso, `Dive Into Python`__ es un libro online fantástico (y gratis) para aquellos que comienzan con Python.

source: Those of you who are unfamiliar with version control systems and Trac will find that this tutorial and its links include just enough information to get started. However, you'll probably want to read some more about these different tools if you plan on contributing to Django regularly.
es: Para aquellos que no estén familiarizados con sistemas de control de versiones y Trac, van a encontrar en este tutorial y sus links la información suficiente para empezar. Sin embargo, probablemente quieras empezar a leer más sobre estas diferentes herramientas si tu plan es contribuir con Django regularmente.

source: For the most part though, this tutorial tries to explain as much as possible, so that it can be of use to the widest audience.
es: En gran medida este tutorial trata de explicar tanto como es posible para que resulte útil para una amplia audiencia.

source: Where to get help:
es: Dónde encontrar ayuda:

source: If you're having trouble going through this tutorial, please post a message to `django-developers <https://docs.djangoproject.com/en/dev/internals/mailing-lists/#django-developers-mailing-list>`_ or drop by `#django-dev on irc.freenode.net`__ to chat with other Django users who might be able to help.
es: Si tuvieras algún problema durante este tutorial, por favor posteá un mensaje en `django-developers <https://docs.djangoproject.com/en/dev/internals/mailing-lists/#django-developers-mailing-list>`_ o unite a `#django-dev en irc.freenode.net`__ para hablar con otros usuarios de Django que quizás puedan ayudar (ambos en inglés).

source: What does this tutorial cover?
es: Qué cubre este tutorial?

source: We'll be walking you through contributing a patch to Django for the first time. By the end of this tutorial, you should have a basic understanding of both the tools and the processes involved. Specifically, we'll be covering the following:
es: Vamos a recorrer el camino para contribuir un patch a Django por primera vez. Al final de este tutorial, deberías tener un conocimiento básico sobre las herramientas y los procesos involucrados. Específicamente, cubriremos lo siguiente:

source: Installing Git.
es: Instalar Git.

source: How to download a development copy of Django.
es: Bajar una copia de desarrollo de Django.

source: Running Django's test suite.
es: Correr la test suite de Django.

source: Writing a test for your patch.
es: Escribir un test para el patch.

source: Writing the code for your patch.
es: Escribir el código del patch.

source: Testing your patch.
es: Testear el patch.

source: Generating a patch file for your changes.
es: Generar un archivo con los cambios del patch.

source: Where to look for more information.
es: Dónde buscar más información.

source: Once you're done with the tutorial, you can look through the rest of `Django's documentation on contributing <https://docs.djangoproject.com/en/1.8/internals/contributing/index>`_. It contains lots of great information and is a must read for anyone who'd like to become a regular contributor to Django. If you've got questions, it's probably got the answers.
es: Una vez que terminés este tutorial, podés ver el resto de la `documentación sobre contribuir con Django <https://docs.djangoproject.com/en/1.8/internals/contributing/index>`_. Contiene mucha más información y es algo que uno debe leer si quiere convertirse en un contribuidor regular de Django. Si tenés preguntas, probablemente tendrá las respuestas.

source: Installing Git
es: Instalar Git

source: For this tutorial, you'll need Git installed to download the current development version of Django and to generate patch files for the changes you make.
es: Para este tutorial, necesitaremos tener Git instalado para bajar la versión de desarrollo de Django y generar los archivos con los cambios de nuestro patch.

source: To check whether or not you have Git installed, enter ``git`` into the command line. If you get messages saying that this command could not be found, you'll have to download and install it, see `Git's download page`__.
es: Para chequear si tenemos Git instalado o no, escribimos ``git`` en la línea de comandos. Si obtenemos un mensaje diciendo que este comando no se encontró, tendremos que bajar e instalar Git, ver `Git's download page`__.

source: If you're not that familiar with Git, you can always find out more about its commands (once it's installed) by typing ``git help`` into the command line.
es: Si no estás familiarizado con Git, siempre se puede saber más sobre los comandos (una vez instalado) tipeando ``git help`` en la línea de comandos.

source: Getting a copy of Django's development version
es: Obtener una copia de la versión de desarrollo de Django

source: The first step to contributing to Django is to get a copy of the source code. From the command line, use the ``cd`` command to navigate to the directory where you'll want your local copy of Django to live.
es: El primer paso para contribuir con Django es obtener una copia del código fuente. En la línea de comandos, usamos el comando ``cd`` para navegar al directorio donde queremos que viva nuestra copia local de Django.

source: Download the Django source code repository using the following command::
es: Bajamos el código fuente de Django usando el siguiente comando::

source: For users who wish to use `virtualenv`__, you can use::
es: Para usuarios que quieran usar `virtualenv`__, se puede usar::

source: (where ``django`` is the directory of your clone that contains ``setup.py``) to link your cloned checkout into a virtual environment. This is a great option to isolate your development copy of Django from the rest of your system and avoids potential package conflicts.
es: (donde ``django`` es el directorio del repositorio clonado que contiene el archivo ``setup.py``) para linkear nuestra copia local en el entorno del virtualenv. Es una gran opción para aislar nuestra copia de desarrollo de Django del resto de nuestro sistema y evitar potenciales conflictos de paquetes.

source: Rolling back to a previous revision of Django
es: Volviendo a una revisión anterior de Django

source: For this tutorial, we'll be using ticket :ticket:`17549` as a case study, so we'll rewind Django's version history in git to before that ticket's patch was applied. This will allow us to go through all of the steps involved in writing that patch from scratch, including running Django's test suite.
es: Para este tutorial vamos a usar el :ticket:`17549` como caso de estudio, así que vamos a volver atrás la historia de versionado de Django en git hasta antes de que el patch se aplicó. Esto nos va a permitir recorrer todos los pasos requeridos al escribir un patch desde cero, incluyendo correr la test suite de Django.

source: **Keep in mind that while we'll be using an older revision of Django's trunk for the purposes of the tutorial below, you should always use the current development revision of Django when working on your own patch for a ticket!**
es: **Por más que usemos una revisión más vieja del trunk de Django para los propósitos de este tutorial, siempre se debe usar la revisión actual cuando se trabaja en un patch para un ticket!**

source: The patch for this ticket was written by Ulrich Petri, and it was applied to Django as `commit ac2052ebc84c45709ab5f0f25e685bf656ce79bc`__. Consequently, we'll be using the revision of Django just prior to that, `commit 39f5bc7fc3a4bb43ed8a1358b17fe0521a1a63ac`__.
es: El patch para este ticket fue escrito por Ulrich Petri, y fue aplicado a Django en el `commit ac2052ebc84c45709ab5f0f25e685bf656ce79bc`__. Entonces vamos a usar la revisión anterior a este commit, `commit 39f5bc7fc3a4bb43ed8a1358b17fe0521a1a63ac`__.

source: Navigate into Django's root directory (that's the one that contains ``django``, ``docs``, ``tests``, ``AUTHORS``, etc.). You can then check out the older revision of Django that we'll be using in the tutorial below::
es: Navegamos al directorio raíz de Django (el que contiene ``django``, ``docs``, ``tests``, ``AUTHORS``, etc.). Chequeamos la revisión que vamos a usar para el tutorial::

source: Running Django's test suite for the first time
es: Corriendo la test suite de Django por primera vez

source: When contributing to Django it's very important that your code changes don't introduce bugs into other areas of Django. One way to check that Django still works after you make your changes is by running Django's test suite. If all the tests still pass, then you can be reasonably sure that your changes haven't completely broken Django. If you've never run Django's test suite before, it's a good idea to run it once beforehand just to get familiar with what its output is supposed to look like.
es: Cuando uno contribuye con Django es muy importante que los cambios no introduzcan bugs en otras áreas de Django. Una manera de chequear que Django todavía funciona después de hacer cambios es correr la test suite. Si todos los tests todavía pasan, entonces uno puede estar razonablemente seguro de que los cambios no han roto Django. Si nunca corriste la test suite de Django antes, es una buena idea hacerlo una vez antes de comenzar para familiarizarse con la salida.

source: We can run the test suite by simply ``cd``-ing into the Django ``tests/`` directory and, if you're using GNU/Linux, Mac OS X or some other flavor of Unix, run::
es: Podemos correr la test suite simplemente haciendo ``cd`` al directorio ``tests/`` de Django y, si usamos GNU/Linux, Mac OS X o algún otro sabor de Unix, ejecutar::

source: If you're on Windows, the above should work provided that you are using "Git Bash" provided by the default Git install. GitHub has a `nice tutorial`__.
es: Si estamos en Windows, lo de arriba debería funcionar si estamos usando "Git Bash" provisto por la instalación por defecto de Git. GitHub tiene un `buen tutorial`__.

source: If you're using ``virtualenv``, you can omit ``PYTHONPATH=..`` when running the tests. This instructs Python to look for Django in the parent directory of ``tests``. ``virtualenv`` puts your copy of Django on the ``PYTHONPATH`` automatically.
es: Si usamos ``virtualenv``, podemos omitir ``PYTHONPATH=..`` cuando corremos los tests. Esto le dice a Python que busque Django en el directorio padre de ``tests``. ``virtualenv`` pone nuestra copia de Django en el ``PYTHONPATH`` automáticamente.

source: Now sit back and relax. Django's entire test suite has over 4800 different tests, so it can take anywhere from 5 to 15 minutes to run, depending on the speed of your computer.
es: Ahora nos sentamos y esperamos. La test suite de Django tiene más de 4800 tests, así que puede tomar entre 5 y 15 minutos de correr, dependiendo de la velocidad de nuestra computadora.

source: While Django's test suite is running, you'll see a stream of characters representing the status of each test as it's run. ``E`` indicates that an error was raised during a test, and ``F`` indicates that a test's assertions failed. Both of these are considered to be test failures. Meanwhile, ``x`` and ``s`` indicated expected failures and skipped tests, respectively. Dots indicate passing tests.
es: Mientras la suite corre, veremos un flujo de caracteres representando el estado de cada test a medida que corre. ``E`` indica que hubo un error durante el test, y ``F`` indica que una aserción del test falló. Ambos casos se consideran fallas de test. Por otro lado, ``x`` y ``s`` indican fallas esperadas y tests que se saltean, respectivamente. Los puntos indican tests que pasan correctamente.

source: Skipped tests are typically due to missing external libraries required to run the test; see `Running all the tests <https://docs.djangoproject.com/en/1.8/internals/contributing/writing-code/unit-tests/#running-unit-tests-dependencies>`_ for a list of dependencies and be sure to install any for tests related to the changes you are making (we won't need any for this tutorial).
es: Los tests que se saltean son típicamente a causa de librerías externas que se requieren para el test pero que no están disponibles; ver `Corriendo todos los tests <https://docs.djangoproject.com/en/1.8/internals/contributing/writing-code/unit-tests/#running-unit-tests-dependencies>`_ para una lista de dependencias y asegurarse de instalarlas para los tests relacionados de acuerdo a los cambios que estemos haciendo (no será necesario para este tutorial).

source: Once the tests complete, you should be greeted with a message informing you whether the test suite passed or failed. Since you haven't yet made any changes to Django's code, the entire test suite **should** pass. If you get failures or errors make sure you've followed all of the previous steps properly. See `Running the unit tests <https://docs.djangoproject.com/en/1.8/internals/contributing/writing-code/unit-tests/#running-unit-tests>`_ for more information.
es: Una vez que se completan los tests, deberíamos obtener un mensaje que nos informa si la test suite pasó o falló. Como no hemos hecho ningún cambio al código, **debería** haber pasado. Si tuviéramos algún fallo o error, deberíamos asegurarnos que seguimos los pasos previos correctamente. Ver `Corriendo los unit tests <https://docs.djangoproject.com/en/1.8/internals/contributing/writing-code/unit-tests/#running-unit-tests>`_ para más información.

source: Note that the latest Django trunk may not always be stable. When developing against trunk, you can check `Django's continuous integration builds`__ to determine if the failures are specific to your machine or if they are also present in Django's official builds. If you click to view a particular build, you can view the "Configuration Matrix" which shows failures broken down by Python version and database backend.
es: Notar que la última revisión del trunk de Django podría no siempre ser estable. Cuando se desarrolla contra trunk, se puede chequear `Django's continuous integration builds`__ para determinar si los fallos son específicos de nuestra máquina o también están presentes en los builds oficiales de Django. Si uno cliquea para ver un build particular, puede ver la "Matriz de configuración" que muestra las fallas detalladas por versión de Python y backend de base de datos.

source: For this tutorial and the ticket we're working on, testing against SQLite is sufficient, however, it's possible (and sometimes necessary) to `run the tests using a different database <https://docs.djangoproject.com/en/1.8/internals/contributing/writing-code/unit-tests/#running-unit-tests-settings>`_.
es: Para este tutorial y el ticket en el que vamos a trabajar, testear contra SQLite es suficiente, pero es posible (y a veces necesario) `correr los tests usando una base de datos diferente <https://docs.djangoproject.com/en/1.8/internals/contributing/writing-code/unit-tests/#running-unit-tests-settings>`_.

source: Writing some tests for your ticket
es: Escribir tests para el ticket

source: In most cases, for a patch to be accepted into Django it has to include tests. For bug fix patches, this means writing a regression test to ensure that the bug is never reintroduced into Django later on. A regression test should be written in such a way that it will fail while the bug still exists and pass once the bug has been fixed. For patches containing new features, you'll need to include tests which ensure that the new features are working correctly. They too should fail when the new feature is not present, and then pass once it has been implemented.
es: En la mayoría de los casos para que un patch se acepte en Django tiene que incluir tests. Para patches correspondientes a arreglar un bug, esto significa escribir un test de regresión para asegurarse de que el bug no se reintroduce nuevamente. Un test de regresión se debe escribir de tal manera que falle cuando el bug todavía existe y pase cuando el bug se haya arreglado. Para patches de nuevas funcionalidades, es necesario incluir tests que aseguren que la nueva funcionalidad funciona correctamente. También deben fallar cuando la nueva funcionalidad no está presente, y pasar una vez que se haya implementado.

source: A good way to do this is to write your new tests first, before making any changes to the code. This style of development is called `test-driven development`__ and can be applied to both entire projects and single patches. After writing your tests, you then run them to make sure that they do indeed fail (since you haven't fixed that bug or added that feature yet). If your new tests don't fail, you'll need to fix them so that they do. After all, a regression test that passes regardless of whether a bug is present is not very helpful at preventing that bug from reoccurring down the road.
es: Una buena manera de hacer esto es escribir los tests primero, antes de hacer cualquier cambio al código. Este estilo de desarrollo se llama `test-driven development`__ y se puede aplicar tanto a proyectos enteros como a patches. Después de escribir los tests, se corren para estar seguros de que de hecho fallan (ya que no se ha escrito el código que arregla el bug o agrega la funcionalidad todavía). Si los tests no fallan, es necesario arreglarlos para que fallen. Después de todo un test de regresión que pasa independientemente de si el bug está presente o no no es muy útil previniendo que el bug reaparezca más tarde.

source: Now for our hands-on example.
es: Ahora, manos al ejemplo.

source: Writing some tests for ticket #17549
es: Escribir tests para el ticket #17549

source: Ticket :ticket:`17549` describes the following, small feature addition:
es: El :ticket:`17549`describe la siguiente funcionalidad a agregar:

source: It's useful for URLField to give you a way to open the URL; otherwise you might as well use a CharField.
es: Es útil para un URLField tener la opción de abrir la URL; de otra forma uno podría usar un CharField igualmente.

source: In order to resolve this ticket, we'll add a ``render`` method to the ``AdminURLFieldWidget`` in order to display a clickable link above the input widget. Before we make those changes though, we're going to write a couple tests to verify that our modification functions correctly and continues to function correctly in the future.
es: Para resolver este ticket vamos a agregar un método ``render`` al ``AdminURLFieldWidget`` para que se muestre un link cliqueable arriba del widget. Pero antes de hacer ese cambio, vamos a escribir un par de tests que verifiquen que nuestras modificaciones funcionarían correctamente, y lo continuarían haciendo en el futuro.

source: Navigate to Django's ``tests/regressiontests/admin_widgets/`` folder and open the ``tests.py`` file. Add the following code on line 269 right before the ``AdminFileWidgetTest`` class::
es: Navegamos al directorio ``tests/regressiontests/admin_widgets/`` de Django y abrimos el archivo ``tests.py``. Agregamos el siguiente código en la línea 269 justo antes de la clase ``AdminFileWidgetTest``::

source: The new tests check to see that the ``render`` method we'll be adding works correctly in a couple different situations.
es: Los nuevos tests chequean que el método ``render`` que vamos a agregar funciona correctamente en un par de situaciones diferentes.

source: But this testing thing looks kinda hard...
es: Pero esto parece un tanto difícil...

source: If you've never had to deal with tests before, they can look a little hard to write at first glance. Fortunately, testing is a *very* big subject in computer programming, so there's lots of information out there:
es: Si nunca tuviste que lidiar con tests antes, puede parece un poco difícil escribir los tests a primera vista. Afortunadamente, el testing es un tema *importante* en programación, así que hay mucha información:

source: A good first look at writing tests for Django can be found in the documentation on `/topics/testing/overview <https://docs.djangoproject.com/en/1.8/topics/testing/overview>`_.
es: Un buen primer vistazo sobre escribir tests para Django se puede encontrar en la documentación en `Testeando aplicaciones Django <https://docs.djangoproject.com/en/1.8/topics/testing/overview>`_.

source: Dive Into Python (a free online book for beginning Python developers) includes a great `introduction to Unit Testing`__.
es: Dive Into Python (libro online gratis para desarrolladores que empiezan con Python) incluye una gran `introducción a Unit Testing`__.

source: After reading those, if you want something a little meatier to sink your teeth into, there's always the `Python unittest documentation`__.
es: Después de leer estos, siempre está la `documentación de unittest de Python`__.

source: Running your new test
es: Correr los nuevos tests

source: Remember that we haven't actually made any modifications to ``AdminURLFieldWidget`` yet, so our tests are going to fail. Let's run all the tests in the ``model_forms_regress`` folder to make sure that's really what happens. From the command line, ``cd`` into the Django ``tests/`` directory and run::
es: Recordemos que todavía no hemos hecho ninguna modificación a ``AdminURLFieldWidget``, entonces nuestros tests van a fallar. Corramos los tests en el directorio ``model_forms_regress`` para asegurarnos de que eso realmente sucede. En la línea de comandos, ``cd`` al directorio ``tests/`` de Django y corremos::

source: If the tests ran correctly, you should see three failures corresponding to each of the test methods we added. If all of the tests passed, then you'll want to make sure that you added the new test shown above to the appropriate folder and class.
es: Si los tests corren correctamente, deberíamos ver tres fallas correspondientes a cada uno de los métodos de test que agregamos. Si todos los tests pasan, entonces deberíamos revisar que agregamos los tests en el directorio y clase apropiados.

source: Writing the code for your ticket
es: Escribir el código para el ticket
