Repository: igorrocha/django-tutorial
Catalog: locale/*/LC_MESSAGES/intro.po
Languages: es

source: That code loads the template called ``polls/index.html`` and passes it a context. The context is a dictionary mapping template variable names to Python objects.
es: Ese código carga el template llamado ``polls/index.html`` y le pasa un contexto. El contexto es un diccionario que mapea nombres de variable a objetos Python.

source: Load the page by pointing your browser at "/polls/", and you should see a bulleted-list containing the "What's up" question from Tutorial 1. The link points to the question's detail page.
es: Carguemos la página apuntando el browser a "/polls/", y deberíamos ver una lista conteniendo la pregunta "What's up" del Tutorial 1. El link apunta a la página de detall de la pregunta.

source: A shortcut: :func:`~django.shortcuts.render`
es: Un atajo: :func:`~django.shortcuts.render`

source: It's a very common idiom to load a template, fill a context and return an :class:`~django.http.HttpResponse` object with the result of the rendered template. Django provides a shortcut. Here's the full ``index()`` view, rewritten:
es: La acción de cargar un template, armar un contexto y devolver un objeto :class:`~django.http.HttpResponse` con el resultado de renderizar el template es muy común. Django provee un atajo. Aquí está la view ``index()`` reescrita:

source: Note that once we've done this in all these views, we no longer need to import :mod:`~django.template.loader`, :class:`~django.template.RequestContext` and :class:`~django.http.HttpResponse` (you'll want to keep ``HttpResponse`` if you still have the stub methods for ``detail``, ``results``, and ``vote``).
es: Una vez que hayamos hecho esto para todas estas views, ya no necesitamos importar :mod:`~django.template.loader`, :class:`~django.template.RequestContext` y :class:`~django.http.HttpResponse` (habrá que mantener ``HttpResponse`` si es que todavía tenemos métodos stub para ``detail``, ``results`` y ``vote``).

source: The :func:`~django.shortcuts.render` function takes the request object as its first argument, a template name as its second argument and a dictionary as its optional third argument. It returns an :class:`~django.http.HttpResponse` object of the given template rendered with the given context.
es: La función :func:`~django.shortcuts.render` toma un objeto ``request`` como primer un argumento, un nombre de template como segundo argumento y un diccionario como tercer argumento opcional. Devuelve un objeto :class:`~django.http.HttpResponse` con el template renderizado con el contexto dado.

source: Raising a 404 error
es: Levantando un error 404

source: Now, let's tackle the question detail view -- the page that displays the question text for a given poll. Here's the view:
es: Ahora veamos la view de detalle de una pregunta -- la página que muestra el texto de la pregunta. Aquí está la view:

source: The new concept here: The view raises the :exc:`~django.http.Http404` exception if a question with the requested ID doesn't exist.
es: El nuevo concepto aquí: la view levanta una excepción :exc:`~django.http.Http404` si no existe una pregunta con el ID dado.

source: We'll discuss what you could put in that ``polls/detail.html`` template a bit later, but if you'd like to quickly get the above example working, a file containing just:
es: Veremos qué podríamos poner en el template ``polls/detail.html`` luego, pero si quisiéramos tener el ejemplo arriba funcionando rápidamente, esto alcanza para empezar:

source: will get you started for now.
es: para ponernos en marcha por ahora.

source: A shortcut: :func:`~django.shortcuts.get_object_or_404`
es: Un atajo: :func:`~django.shortcuts.get_object_or_404`

source: It's a very common idiom to use :meth:`~django.db.models.query.QuerySet.get` and raise :exc:`~django.http.Http404` if the object doesn't exist. Django provides a shortcut. Here's the ``detail()`` view, rewritten:
es: Es muy común usar el método :meth:`~django.db.models.query.QuerySet.get` y levantar un :exc:`~django.http.Http404` si el objeto no existe. Django provee un atajo. Esta la view ``detail()``, actualizada:

source: The :func:`~django.shortcuts.get_object_or_404` function takes a Django model as its first argument and an arbitrary number of keyword arguments, which it passes to the :meth:`~django.db.models.query.QuerySet.get` function of the model's manager. It raises :exc:`~django.http.Http404` if the object doesn't exist.
es: La función :func:`~django.shortcuts.get_object_or_404` toma un modelo Django como primer argumento y un número arbitrario de argumentos nombrados, que se pasan a la función :meth:`~django.db.models.query.QuerySet.get` del manager del modelo. Levanta un :exc:`~django.http.Http404` si el objeto no existe.

source: Why do we use a helper function :func:`~django.shortcuts.get_object_or_404` instead of automatically catching the :exc:`~django.core.exceptions.ObjectDoesNotExist` exceptions at a higher level, or having the model API raise :exc:`~django.http.Http404` instead of :exc:`~django.core.exceptions.ObjectDoesNotExist`?
es: Por qué usamos una función :func:`~django.shortcuts.get_object_or_404` en lugar de manejar automáticamente la excepción :exc:`~django.core.exceptions.ObjectDoesNotExist` a un nivel más arriba, o hacer que la API a nivel modelo levante :exc:`~django.http.Http404` en lugar de :exc:`~django.core.exceptions.ObjectDoesNotExist`?

source: Because that would couple the model layer to the view layer. One of the foremost design goals of Django is to maintain loose coupling. Some controlled coupling is introduced in the :mod:`django.shortcuts` module.
es: Porque esto acoplaría la capa de modelos a la capa de views. Uno de los objetivos de diseño de Django es mantener bajo acoplamiento. Cierto acoplamiento controlado se introduce en el módulo :mod:`django.shortcuts`.

source: There's also a :func:`~django.shortcuts.get_list_or_404` function, which works just as :func:`~django.shortcuts.get_object_or_404` -- except using :meth:`~django.db.models.query.QuerySet.filter` instead of :meth:`~django.db.models.query.QuerySet.get`. It raises :exc:`~django.http.Http404` if the list is empty.
es: Existe también una función :func:`~django.shortcuts.get_list_or_404`, que funciona como :func:`~django.shortcuts.get_object_or_404` -- excepto que usa :meth:`~django.db.models.query.QuerySet.filter` en lugar de :meth:`~django.db.models.query.QuerySet.get`. Levanta un :exc:`~django.http.Http404` si la lista es vacía.

source: Use the template system
es: Usando el sistema de templates

source: Back to the ``detail()`` view for our poll application. Given the context variable ``question``, here's what the ``polls/detail.html`` template might look like:
es: Volvamos a la view ``detail()`` de nuestra aplicación. Dada la variable de contexto ``question``, veamos como podría lucir el template ``polls/detail.html``:

source: The template system uses dot-lookup syntax to access variable attributes. In the example of ``{{ question.question_text }}``, first Django does a dictionary lookup on the object ``question``. Failing that, it tries an attribute lookup -- which works, in this case. If attribute lookup had failed, it would've tried a list-index lookup.
es: El sistema de templates usa sintaxis de punto para acceder a los atributos de variable. En el ejemplo de ``{{ question.question_text }}``, Django primero hace una búsqueda de diccionario sobre el objeto ``question``. Si eso falla, intenta una búsqueda de atributo -- que en este caso, funciona. Si hubiera fallado, se hubiera intentado una búsqueda por índice de lista.

source: Method-calling happens in the :ttag:`{% for %}<for>` loop: ``question.choice_set.all`` is interpreted as the Python code ``question.choice_set.all()``, which returns an iterable of ``Choice`` objects and is suitable for use in the :ttag:`{% for %}<for>` tag.
es: Una llamada de método se da en el loop :ttag:`{% for %}<for>`: ``question.choice_set.all`` se interpreta como el código Python ``question.choice_set.all()``, que devuelve un iterable de objetos ``Choice`` y usable para el tag :ttag:`{% for %}<for>`.

source: See the `template guide <https://docs.djangoproject.com/en/1.8/topics/templates>`_ for more about templates.
es: Para más detalles sobre templates, se puede ver `template guide <https://docs.djangoproject.com/en/1.8/topics/templates>`_.

source: Removing hardcoded URLs in templates
es: Borrando URLs escritas explícitamente en templates

source: Remember, when we wrote the link to a question in the ``polls/index.html`` template, the link was partially hardcoded like this:
es: Recordemos que cuando escribimos el link a una encuesta en el template ``polls/index.html``, el link estaba parcialmente escrito "a mano":

source: The problem with this hardcoded, tightly-coupled approach is that it becomes challenging to change URLs on projects with a lot of templates. However, since you defined the name argument in the :func:`~django.conf.urls.url` functions in the ``polls.urls`` module, you can remove a reliance on specific URL paths defined in your url configurations by using the ``{% url %}`` template tag:
es: El problema con esto, es que es una aproximación muy acoplada que hace que sea un desafío cambiar las URLs en un proyecto con muchos templates. Sin embargo, como definimos el argumento ``name`` en las llamadas a :func:`~django.conf.urls.url` en el módulo ``polls.urls``, podemos eliminar la dependencia de URLs fijas usando el template tag ``{% url %}``:

source: The way this works is by looking up the URL definition as specified in the ``polls.urls`` module. You can see exactly where the URL name of 'detail' is defined below::
es: La forma en que esto funciona es buscando la definición de la URL especificada en el módulo ``polls.urls``. Podemos ver dónde se define el nombre 'detail' de la URL aquí::

source: If you want to change the URL of the polls detail view to something else, perhaps to something like ``polls/specifics/12/`` instead of doing it in the template (or templates) you would change it in ``polls/urls.py``::
es: Si uno quisiera cambiar la URL de la view de detalle de pregunta a algo distinto, tal vez algo como ``polls/specifics/12/``, en lugar de hacerlo en el template (o templates), bastaría con cambiarlo en ``polls/urls.py``::

source: Namespacing URL names
es: Espacio de nombres en URLs

source: The tutorial project has just one app, ``polls``. In real Django projects, there might be five, ten, twenty apps or more. How does Django differentiate the URL names between them? For example, the ``polls`` app has a ``detail`` view, and so might an app on the same project that is for a blog. How does one make it so that Django knows which app view to create for a url when using the ``{% url %}`` template tag?
es: El proyecto de este tutorial tiene sólo una app, ``polls``. En proyectos Django reales, podría haber cinco, diez, veinte o más apps. Cómo Django distingue los nombres de las URLs entre todas las apps? Por ejemplo, la app ``polls`` tiene una view ``detail``, y podría ser que otra app para un blog en el mismo proyecto también. Cómo hace Django para saber la view de qué app usar al resolver un template tag ``{% url %}``?

source: The answer is to add namespaces to your root URLconf. In the ``mysite/urls.py`` file, go ahead and change it to include namespacing:
es: La respuesta es agregar espacios de nombres al URLconf raíz. Cambiamos el archivo ``mysite/urls.py`` para incluir espacios de nombres:

source: Now change your ``polls/index.html`` template from:
es: Ahora cambiamos el template ``polls/index.html`` de:

source: to point at the namespaced detail view:
es: a que apunte a la view de detalle con el espacio de nombres:

source: When you're comfortable with writing views, read :doc:`part 4 of this tutorial </intro/tutorial04>` to learn about simple form processing and generic views.
es: Una vez que estés cómodo escribiendo views, podés pasar a la :doc:`parte 4 del tutorial</intro/tutorial04>` para aprender sobre procesamiento simple de forms y views genéricas.

source: Writing your first Django app, part 4
es: Escribiendo tu primera Django app, parte 4

source: This tutorial begins where :doc:`Tutorial 3 </intro/tutorial03>` left off. We're continuing the Web-poll application and will focus on simple form processing and cutting down our code.
es: Este tutorial comienza donde dejó el :doc:`Tutorial 3 </intro/tutorial03>`. Vamos a continuar la aplicación de preguntas concentrándonos en procesar forms simples y reducir nuestro código.

source: Write a simple form
es: Escribir un form simple

source: Let's update our poll detail template ("polls/detail.html") from the last tutorial, so that the template contains an HTML ``<form>`` element:
es: Actualicemos el template de detalle de una encuesta ("polls/detail.html") del último tutorial para que contenga un elemento HTML ``<form>``:

source: A quick rundown:
es: Un repaso rápido:

source: The above template displays a radio button for each question choice. The ``value`` of each radio button is the associated question choice's ID. The ``name`` of each radio button is ``"choice"``. That means, when somebody selects one of the radio buttons and submits the form, it'll send the POST data ``choice=#`` where # is the ID of the selected choice. This is the basic concept of HTML forms.
es: El template de arriba muestra un radio button para cada opción de la pregunta. El ``value`` de cada radio es el ID asociado a cada opción de la pregunta. El ``name``, es ``"choice"``. Esto significa que cuando alguien elige una de las opciones y envía el form, se envía ``choice=#`` como data del POST, donde # es el ID de la opción elegida. Este es un concepto básico de forms HTML.

source: We set the form's ``action`` to ``{% url 'polls:vote' question.id %}``, and we set ``method="post"``. Using ``method="post"`` (as opposed to ``method="get"``) is very important, because the act of submitting this form will alter data server-side. Whenever you create a form that alters data server-side, use ``method="post"``. This tip isn't specific to Django; it's just good Web development practice.
es: Establecemos como ``action`` del form ``{% url 'polls:vote' question.id %}``, y ``method="post"``. Usar ``method="post"`` (en contraposición a ``method="get"``) es muy importante, porque la acción de enviar el form va a modificar datos del lado del servidor. Cada vez que uno crea un form que altere datos del lado del servidor, usar ``method="post"``. Este consejo no es particular para Django; es una buena práctica de desarrollo web.

source: ``forloop.counter`` indicates how many times the :ttag:`for` tag has gone through its loop
es: ``forloop.counter`` indica cuantas veces el tag :ttag:`for` iteró en el ciclo

source: Since we're creating a POST form (which can have the effect of modifying data), we need to worry about Cross Site Request Forgeries. Thankfully, you don't have to worry too hard, because Django comes with a very easy-to-use system for protecting against it. In short, all POST forms that are targeted at internal URLs should use the :ttag:`{% csrf_token %}<csrf_token>` template tag.
es: Como estamos creando un form POST (que puede tener el efecto de modificar datos), necesitamos preocuparnos por Cross Site Request Forgeries (CSRF). Afortunadamente no hace falta demasiado, porque Django viene con un sistema fácil de usar para protegerse contra este tipo de ataques. Simplemente todos los forms que hagan POST contra una URL interna deberían usar el template tag :ttag:`{% csrf_token %}<csrf_token>`.

source: Now, let's create a Django view that handles the submitted data and does something with it. Remember, in :doc:`Tutorial 3 </intro/tutorial03>`, we created a URLconf for the polls application that includes this line:
es: Ahora vamos a crear una view Django que maneje los datos enviados y haga algo con ellos. Recordemos que en el :doc:`Tutorial 3 </intro/tutorial03>` creamos un URLconf para nuestra app que incluía la siguiente línea:

source: We also created a dummy implementation of the ``vote()`` function. Let's create a real version. Add the following to ``polls/views.py``:
es: También habíamos creado una implementación boba de la función ``vote()``. Hagamos una implementación real. Agregamos lo siguiente a ``polls/views.py``:

source: This code includes a few things we haven't covered yet in this tutorial:
es: Este código incluye algunas cosas que no hemos cubierto hasta el momento:

source: :attr:`request.POST <django.http.HttpRequest.POST>` is a dictionary-like object that lets you access submitted data by key name. In this case, ``request.POST['choice']`` returns the ID of the selected choice, as a string. :attr:`request.POST <django.http.HttpRequest.POST>` values are always strings.
es: :attr:`request.POST <django.http.HttpRequest.POST>` es un objeto diccionario-like que nos permite acceder a los datos enviados usando los nombres como clave. En este caso ``request.POST['choice']`` devuelve el ID de la opción elegida, como string. Los valores de :attr:`request.POST <django.http.HttpRequest.POST>` son siempre strings.

source: Note that Django also provides :attr:`request.GET <django.http.HttpRequest.GET>` for accessing GET data in the same way -- but we're explicitly using :attr:`request.POST <django.http.HttpRequest.POST>` in our code, to ensure that data is only altered via a POST call.
es: Notar que Django también provee :attr:`request.GET <django.http.HttpRequest.GET>` para acceder a los datos en el GET de la misma manera -- pero estamos usando explícitamente :attr:`request.POST <django.http.HttpRequest.POST>` en nuestro código para asegurarnos de que los datos solamente se alteren vía una llamada POST.

source: ``request.POST['choice']`` will raise :exc:`KeyError` if ``choice`` wasn't provided in POST data. The above code checks for :exc:`KeyError` and redisplays the question form with an error message if ``choice`` isn't given.
es: ``request.POST['choice']`` va a levantar :exc:`KeyError` si ``choice`` no estuviera en los datos del POST. El código de arriba chequea por esta excepción y en ese caso vuelve a mostrar el form con un mensaje de error.

source: After incrementing the choice count, the code returns an :class:`~django.http.HttpResponseRedirect` rather than a normal :class:`~django.http.HttpResponse`. :class:`~django.http.HttpResponseRedirect` takes a single argument: the URL to which the user will be redirected (see the following point for how we construct the URL in this case).
es: Después de incrementar el contador de la opción, el código devuelve un :class:`~django.http.HttpResponseRedirect` en lugar de un :class:`~django.http.HttpResponse`. :class:`~django.http.HttpResponseRedirect` toma un único argumento: la URL a la que el usuario será redirigido (ver el punto siguiente sobre cómo construir la URL en este caso).

source: As the Python comment above points out, you should always return an :class:`~django.http.HttpResponseRedirect` after successfully dealing with POST data. This tip isn't specific to Django; it's just good Web development practice.
es: Como dice el comentario en el código de arriba, uno siempre debería devolver un :class:`~django.http.HttpResponseRedirect` después de manejar exitosamente un POST. Este consejo no es específico a Django; es una buena práctica de desarrollo web.

source: We are using the :func:`~django.core.urlresolvers.reverse` function in the :class:`~django.http.HttpResponseRedirect` constructor in this example. This function helps avoid having to hardcode a URL in the view function. It is given the name of the view that we want to pass control to and the variable portion of the URL pattern that points to that view. In this case, using the URLconf we set up in Tutorial 3, this :func:`~django.core.urlresolvers.reverse` call will return a string like ::
es: Estamos usando la función :func:`~django.core.urlresolvers.reverse` en el constructor de :class:`~django.http.HttpResponseRedirect`. Esta función nos ayuda a no escribir explícitamente una URL en la función de view. Se le pasa el nombre de la view a la que queremos pasar el control y los argumentos variables del patrón de URL que apunta a esa view. En este caso, usando el URLconf que configuramos en el Tutorial 3, esta llamada a :func:`~django.core.urlresolvers.reverse` devolvería un string como el siguiente::

source: ... where the ``3`` is the value of ``p.id``. This redirected URL will then call the ``'results'`` view to display the final page.
es: ... donde ``3`` es el valor de ``p.id``. Esta URL nos va a redirigir, llamando a la view ``'results'`` para mostrar la página final.

source: As mentioned in Tutorial 3, ``request`` is a :class:`~django.http.HttpRequest` object. For more on :class:`~django.http.HttpRequest` objects, see the `request and response documentation <https://docs.djangoproject.com/en/1.8/ref/request-response>`_.
es: Como se mencionó en el Tutorial 3, ``request`` es un objeto :class:`~django.http.HttpRequest`. Para más detalles sobre este tipo de objetos, se puede ver la `documentación sobre request y response <https://docs.djangoproject.com/en/1.8/ref/request-response>`_.

source: After somebody votes in a question, the ``vote()`` view redirects to the results page for the question. Let's write that view:
es: Después de que alguien vota en una encuesta, la view ``vote()`` lo redirige a la página de resultados de la pregunta. Escribamos esta view:

source: This is almost exactly the same as the ``detail()`` view from :doc:`Tutorial 3 </intro/tutorial03>`. The only difference is the template name. We'll fix this redundancy later.
es: Esto es casi exactamente igual a la view ``detail()`` del :doc:`Tutorial 3 </intro/tutorial03>`. La única diferencia es el nombre del template. Vamos a solucionar esta redundancia luego.

source: Now, create a ``polls/results.html`` template:
es: Ahora, creamos el template ``polls/results.html``:

source: Now, go to ``/polls/1/`` in your browser and vote in the question. You should see a results page that gets updated each time you vote. If you submit the form without having chosen a choice, you should see the error message.
es: Vamos a ``/polls/1/`` en el browser y votamos en la encuesta. Deberíamos ver una página de resultados que se actualiza cada vez que uno vota. Si se envía el form sin elegir una opción, se debería mostrar un mensaje de error.

source: Use generic views: Less code is better
es: Usando views genéricas (generic views): Menos código es mejor

source: The ``detail()`` (from :doc:`Tutorial 3 </intro/tutorial03>`) and ``results()`` views are very simple -- and, as mentioned above, redundant. The ``index()`` view (also from Tutorial 3), which displays a list of polls, is similar.
es: Las views ``detail()`` (del :doc:`Tutorial 3 </intro/tutorial03>`) y ``results()`` son súper simples -- y, cómo se menciona arriba, redundantes. La view ``index()`` (también del Tutorial 3), que muestra una lista de preguntas, es similar.

source: These views represent a common case of basic Web development: getting data from the database according to a parameter passed in the URL, loading a template and returning the rendered template. Because this is so common, Django provides a shortcut, called the "generic views" system.
es: Estas views representan un caso común en el desarrollo web básico: obtener datos de una base de datos de acuerdo a un parámetro pasado en la URL, cargar un template y devolver el template renderizado. Por ser tan usual, Django provee un atajo, el sistema de "generic views" (views genéricas).

source: Generic views abstract common patterns to the point where you don't even need to write Python code to write an app.
es: Las views genéricas abstraen patrones comunes, al punto en que uno no necesita prácticamente escribir código Python en una app.
