Repository: igorrocha/django-tutorial
Catalog: locale/*/LC_MESSAGES/intro.po
Languages: es

source: Also, note the :setting:`INSTALLED_APPS` setting at the top of the file. That holds the names of all Django applications that are activated in this Django instance. Apps can be used in multiple projects, and you can package and distribute them for use by others in their projects.
es: También podés mirar el setting :setting:`INSTALLED_APPS` hacia el final del archivo. Éste registra los nombres de todas las aplicaciones Django que están activadas en esta instancia Django. Las apps se pueden usar en múltiples proyectos, y podés empaquetarlas y distribuirlas para su uso por otros en sus respectivos proyectos.

source: By default, :setting:`INSTALLED_APPS` contains the following apps, all of which come with Django:
es: Por defecto, :setting:`INSTALLED_APPS` contiene las siguientes apps, todas provistas por Django:

source: :mod:`django.contrib.admin` -- The admin site. You'll use it in :doc:`part 2 of this tutorial </intro/tutorial02>`.
es: :mod:`django.contrib.admin` -- El sitio de administración. Lo vamos a usar en :doc:`la parte 2 de este tutorial </intro/tutorial02>`.

source: :mod:`django.contrib.auth` -- An authentication system.
es: :mod:`django.contrib.auth` -- Sistema de autenticación.

source: :mod:`django.contrib.contenttypes` -- A framework for content types.
es: :mod:`django.contrib.contenttypes` -- Un framework para tipos de contenido.

source: :mod:`django.contrib.sessions` -- A session framework.
es: :mod:`django.contrib.sessions` -- Un framework para manejo de sesiones.

source: :mod:`django.contrib.messages` -- A messaging framework.
es: :mod:`django.contrib.messages` -- Un framework de mensajes.

source: :mod:`django.contrib.staticfiles` -- A framework for managing static files.
es: :mod:`django.contrib.staticfiles` -- Un framework para manejar los archivos estáticos.

source: These applications are included by default as a convenience for the common case.
es: Estas aplicaciones están incluidas por defecto como conveniencia para el caso común.

source: Some of these applications makes use of at least one database table, though, so we need to create the tables in the database before we can use them. To do that, run the following command:
es: Algunas de estas aplicaciones hace uso de al menos una tabla de la base de datos, entonces necesitaremos crear las respectivas tablas antes de poder usarlas. Para ello corremos el siguiente comando:

source: The :djadmin:`migrate` command looks at the :setting:`INSTALLED_APPS` setting and creates any necessary database tables according to the database settings in your :file:`mysite/settings.py` file and the database migrations shipped with the app (we'll cover those later). You'll see a message for each migration it applies. If you're interested, run the command-line client for your database and type ``\dt`` (PostgreSQL), ``SHOW TABLES;`` (MySQL), or ``.schema`` (SQLite) to display the tables Django created.
es: El comando :djadmin:`migrate` se fija en el setting :setting:`INSTALLED_APPS` y crea las tablas necesarias en la base de datos determinada por los parámetros establecidos en el archivo :file:`mysite/settings.py`. Verás un mensaje por cada migración que se aplica. Si estás interesado, podés correr el cliente de línea de comandos de tu base de datos y tipear ``\dt`` (PostgreSQL), ``SHOW TABLES;`` (MySQL), o ``.schema`` (SQLite) para ver las tablas que Django creó.

source: For the minimalists
es: Para los minimalistas

source: Like we said above, the default applications are included for the common case, but not everybody needs them. If you don't need any or all of them, feel free to comment-out or delete the appropriate line(s) from :setting:`INSTALLED_APPS` before running :djadmin:`migrate`. The :djadmin:`migrate` command will only run migrations for apps in :setting:`INSTALLED_APPS`.
es: Como dijimos arriba, las aplicaciones incluidas por defecto son para el caso común, pero no todos las necesitan. Si no necesitás alguna o ninguna de las mismas, sos libre de comentar o borrar las líneas apropiadas de :setting:`INSTALLED_APPS` antes de correr :djadmin:`migrate`. El comando :djadmin:`migrate` sólo creará las tablas para las apps en :setting:`INSTALLED_APPS`.

source: The development server
es: El servidor de desarrollo

source: Let's verify your Django project works. Change into the outer :file:`mysite` directory, if you haven't already, and run the following commands:
es: Verifiquemos que el proyecto Django funciona. Cambiamos al directorio :file:`mysite` de más afuera, si no lo habías hecho, y corremos los siguientes comandos:

source: You'll see the following output on the command line:
es: Veremos la siguiente salida en la línea de comandos:

source: You've started the Django development server, a lightweight Web server written purely in Python. We've included this with Django so you can develop things rapidly, without having to deal with configuring a production server -- such as Apache -- until you're ready for production.
es: Hemos levantado el servidor de desarrollo de Django, un servidor web liviano escrito puramente en Python. Viene incluido con Django para permitir desarrollar rápidamente, sin necesidad de configurar un servidor de producción -- como Apache -- hasta el momento en que todo esté listo para producción.

source: Now's a good time to note: **don't** use this server in anything resembling a production environment. It's intended only for use while developing. (We're in the business of making Web frameworks, not Web servers.)
es: Este es un buen momento para notar: **NO** hay que usar este servidor para nada que se parezca a un entorno de producción. Está pensado solamente para desarrollo (Django es un framework web, no un servidor).

source: Now that the server's running, visit http://127.0.0.1:8000/ with your Web browser. You'll see a "Welcome to Django" page, in pleasant, light-blue pastel. It worked!
es: Ahora que el servidor está corriendo, podemos visitar http://127.0.0.1:8000/ en nuestro browser. Deberíamos ver una página con el mensaje \"Welcome to Django\". Funcionó!

source: Changing the port
es: Cambiando el puerto

source: By default, the :djadmin:`runserver` command starts the development server on the internal IP at port 8000.
es: Por defecto, el comando :djadmin:`runserver` levanta el servidor de desarrollo en una IP interna en el puerto 8000.

source: If you want to change the server's port, pass it as a command-line argument. For instance, this command starts the server on port 8080:
es: Si uno quisiera cambiar el puerto, se puede pasar como argumento en la línea de comandos. Por ejemplo, para levantar el servidor escuchando en el puerto 8080:

source: If you want to change the server's IP, pass it along with the port. So to listen on all public IPs (useful if you want to show off your work on other computers), use:
es: Para cambiar la dirección IP del servidor, se pasa junto con el puerto. Entonces, para escuchar en todas las IP públicas (útil para mostrarle nuestro trabajo en otras computadoras), podemos usar:

source: Full docs for the development server can be found in the :djadmin:`runserver` reference.
es: La documentación completa sobre el servidor de desarrollo se puede encontrar en :djadmin:`runserver`.

source: Automatic reloading of :djadmin:`runserver`
es: Recarga automática de :djadmin:`runserver`

source: The development server automatically reloads Python code for each request as needed. You don't need to restart the server for code changes to take effect. However, some actions like adding files don't trigger a restart, so you'll have to restart the server in these cases.
es: El servidor de desarrollo recarga automáticamente el código Python en cada request según sea necesario. No es necesario reiniciar el servidor para que los cambios al código tengan efecto. Sin embargo, algunas acciones como agregar archivos no producen un reinicio automático y entonces será necesario reiniciar el servidor a mano en esos casos.

source: Creating models
es: Creando modelos

source: Now that your environment -- a "project" -- is set up, you're set to start doing work.
es: Ahora que hemos levantado nuestro entorno -- un \"proyecto\" --, estamos listos para empezar a trabajar.

source: Each application you write in Django consists of a Python package that follows a certain convention. Django comes with a utility that automatically generates the basic directory structure of an app, so you can focus on writing code rather than creating directories.
es: Cada aplicación que uno escribe en Django consiste de un paquete Python que sigue una ciera convención. Django trae una utilidad que automáticamente genera la estructura de directorios básica de una app, de tal manera que uno pueda concentrarse en escribir código en lugar de directorios.

source: Projects vs. apps
es: Proyectos vs. apps

source: What's the difference between a project and an app? An app is a Web application that does something -- e.g., a Weblog system, a database of public records or a simple poll app. A project is a collection of configuration and apps for a particular Web site. A project can contain multiple apps. An app can be in multiple projects.
es: Cuál es la diferencia entre un proyecto y una app? Una app es una aplicación web que hace algo -- e.g., un sistema de blog, una base de datos de registros públicos o una aplicación simple de encuestas. Un proyecto es una colección de configuración y apps para un sitio web particular. Un proyecto puede contener múltiples app. Una app puede estar en múltiples proyectos.

source: Your apps can live anywhere on your `Python path`_. In this tutorial, we'll create our poll app right next to your :file:`manage.py` file so that it can be imported as its own top-level module, rather than a submodule of ``mysite``.
es: Las apps viven en cualquier lugar del `Python path`_. En este tutorial, vamos a crear nuestra app en el directorio donde se encuentra el archivo :file:`manage.py`, para que pueda ser importada como módulo de primer nivel, en lugar de ser un submódulo de ``mysite``.

source: To create your app, make sure you're in the same directory as :file:`manage.py` and type this command:
es: Para crear una app, nos aseguramos de estar en el mismo directorio que :file:`manage.py` y corremos el comando:

source: That'll create a directory :file:`polls`, which is laid out like this::
es: Esto creará el directorio :file:`polls`, con la siguiente estructura::

source: This directory structure will house the poll application.
es: Esta estructura de directorio va a almacenar la aplicación ``poll``.

source: The first step in writing a database Web app in Django is to define your models -- essentially, your database layout, with additional metadata.
es: El primer paso al escribir una app web en Django es definir los modelos -- esencialmente, el esquema de base de datos, con metadata adicional.

source: Philosophy
es: Filosofía

source: A model is the single, definitive source of truth about your data. It contains the essential fields and behaviors of the data you're storing. Django follows the `DRY Principle <https://docs.djangoproject.com/en/1.8/misc/design-philosophies/#dry>`_. The goal is to define your data model in one place and automatically derive things from it.
es: Un modelo es la única y definitiva fuente de datos de nuestra información. Contiene los campos y comportamientos esenciales de los datos que vamos a guardar. Django sigue el :ref:`principio DRY <https://docs.djangoproject.com/en/1.8/misc/design-philosophies/#dry>`_. El objetivo es definir el modelo de datos en un lugar y automáticamente derivar lo demás a partir de éste.

source: This includes the migrations - unlike in Ruby On Rails, for example, migrations are entirely derived from your models file, and are essentially just a history that Django can roll through to update your database schema to match your current models.
es: Esto incluye las migraciones - a diferencia de Ruby On Rails, por ejemplo, las migraciones son completamente derivadas del archivo de modelos, y son esencialmente una historia que Django puede seguir para actualizar la base de datos y mantenerla en sincronía con tus modelos.

source: In our simple poll app, we'll create two models: ``Question`` and ``Choice``. A ``Question`` has a question and a publication date. A ``Choice`` has two fields: the text of the choice and a vote tally. Each ``Choice`` is associated with a ``Question``.
es: En nuestra simple app poll, vamos a crear dos modelos: ``Question`` and ``Choice``. Una ``Question`` tiene una pregunta y una fecha de publicación. Una ``Choice`` tiene dos campos: el texto de la opción y un contador de votos. Cada ``Choice`` está asociada a una ``Question``.

source: These concepts are represented by simple Python classes. Edit the :file:`polls/models.py` file so it looks like this:
es: Estos conceptos se representan mediante clases Python. Editamos el archivo :file:`polls/models.py` para que se vea así:

source: The code is straightforward. Each model is represented by a class that subclasses :class:`django.db.models.Model`. Each model has a number of class variables, each of which represents a database field in the model.
es: El código es directo. Cada modelo se representa por una clase que hereda de :class:`django.db.models.Model`. Cada modelo tiene ciertas variables de clase, cada una de las cuales representa un campo de la base de datos en el modelo.

source: Each field is represented by an instance of a :class:`~django.db.models.Field` class -- e.g., :class:`~django.db.models.CharField` for character fields and :class:`~django.db.models.DateTimeField` for datetimes. This tells Django what type of data each field holds.
es: Cada campo se representa como una instancia de una clase :class:`~django.db.models.Field` -- e.g., :class:`~django.db.models.CharField` para campos de caracteres y :class:`~django.db.models.DateTimeField` para fecha y hora. Esto le dice a Django qué tipo de datos almacena cada campo.

source: The name of each :class:`~django.db.models.Field` instance (e.g. ``question_text`` or ``pub_date``) is the field's name, in machine-friendly format. You'll use this value in your Python code, and your database will use it as the column name.
es: El nombre de cada instancia de :class:`~django.db.models.Field` (e.g. ``question_text`` o ``pub_date``) es el nombre del campo, en formato amigable (a nivel código). Vamos a usar este valor en nuestro código, y la base de datos lo va a usar como nombre de columna.

source: You can use an optional first positional argument to a :class:`~django.db.models.Field` to designate a human-readable name. That's used in a couple of introspective parts of Django, and it doubles as documentation. If this field isn't provided, Django will use the machine-readable name. In this example, we've only defined a human-readable name for ``Question.pub_date``. For all other fields in this model, the field's machine-readable name will suffice as its human-readable name.
es: Se puede usar un primer argumento, opcional, de :class:`~django.db.models.Field` para designar un nombre legible (a nivel ser humano). Se usa en algunas partes en que Django hace introspección, y funciona como documentación. Si no se provee este argumento, Django usa el nombre del campo. En el ejemplo, solamente definimos un nombre descriptivo para ``Question.pub_date``. Para todos los demás campos en el modelo, el nombre del campo será suficiente.

source: Some :class:`~django.db.models.Field` classes have required arguments. :class:`~django.db.models.CharField`, for example, requires that you give it a :attr:`~django.db.models.CharField.max_length`. That's used not only in the database schema, but in validation, as we'll soon see.
es: Algunas clases de :class:`~django.db.models.Field` tienen argumentos requeridos. Por ejemplo, :class:`~django.db.models.CharField` requiere que se pase :attr:`~django.db.models.CharField.max_length`. Esto se usa no sólo en el esquema de la base de datos sino también en la validación de los datos, como veremos más adelante.

source: A :class:`~django.db.models.Field` can also have various optional arguments; in this case, we've set the :attr:`~django.db.models.Field.default` value of ``votes`` to 0.
es: Un :class:`~django.db.models.Field` puede tener también varios argumentos opcionales; en este caso, seteamos el valor :attr:`~django.db.models.Field.default` de ``votes`` a 0.

source: Finally, note a relationship is defined, using :class:`~django.db.models.ForeignKey`. That tells Django each ``Choice`` is related to a single ``Question``. Django supports all the common database relationships: many-to-one, many-to-many and one-to-one.
es: Finalmente, notemos que se define una relación, usando :class:`~django.db.models.ForeignKey`. Esto le dice a Django que cada ``Choice`` está relacionada a una única ``Question``. Django soporta todos los tipos de relación comunes en una base de datos: muchos-a-uno, muchos-a-muchos y uno-a-uno.

source: Activating models
es: Activando modelos

source: That small bit of model code gives Django a lot of information. With it, Django is able to:
es: Ese poquito código le da a Django un montón de información. A partir de él, Django puede:

source: Create a database schema (``CREATE TABLE`` statements) for this app.
es: Crear el esquema de base de datos (las sentencias ``CREATE TABLE``) para la app.

source: Create a Python database-access API for accessing ``Question`` and ``Choice`` objects.
es: Crear la API Python de acceso a la base de datos para acceder a los objetos ``Question`` y ``Choice``.

source: But first we need to tell our project that the ``polls`` app is installed.
es: Pero primero debemos informarle a nuestro proyecto que la app ``polls`` está instalada.

source: Django apps are "pluggable": You can use an app in multiple projects, and you can distribute apps, because they don't have to be tied to a given Django installation.
es: Las apps Django son "pluggable": podés usar una app en múltiples proyectos, y distribuirlas, porque no necesitan estar ligadas a una instancia de Django particular.

source: Edit the :file:`mysite/settings.py` file again, and change the :setting:`INSTALLED_APPS` setting to include the string ``'polls'``. So it'll look like this:
es: Editamos de nuevo el archivo :file:`mysite/settings.py`, y cambiamos el setting :setting:`INSTALLED_APPS` para incluir ``'polls'``. Se verá algó así::

source: Now Django knows to include the ``polls`` app. Let's run another command:
es: Ahora Django sabe sobre nuestra app ``polls``. Corramos otro comando:

source: You should see something similar to the following:
es: "Deberíamos ver algo similar a lo siguiente:

source: By running ``makemigrations``, you're telling Django that you've made some changes to your models (in this case, you've made new ones) and that you'd like the changes to be stored as a *migration*.
es: Corriendo ``makemigrations``, le estamos diciendo a Django que hemos hecho algunos cambios a nuestros modelos (en este caso, nuevos modelos) y que quisiéramos registrar esos cambios en una *migración*.

source: Migrations are how Django stores changes to your models (and thus your database schema) - they're just files on disk. You can read the migration for your new model if you like; it's the file ``polls/migrations/0001_initial.py``. Don't worry, you're not expected to read them every time Django makes one, but they're designed to be human-editable in case you want to manually tweak how Django changes things.
es: Las migraciones es como DJango guarda los cambios a nuestros modelos (y por lo tanto al esquema de base de datos) - son solamente archivos en disco. Podríamos leer la migración de nuestro nuevo modelo si quisiéramos; es el archivo ``polls/migrations/0001_initial.py``. No te preocupes, no se espera que uno las lea cada vez que Django crea una nueva, pero están diseñadas para ser editables a mano en caso de que se quiera hacer alguna modificación en la forma que Django aplica los cambios.

source: There's a command that will run the migrations for you and manage your database schema automatically - that's called :djadmin:`migrate`, and we'll come to it in a moment - but first, let's see what SQL that migration would run. The :djadmin:`sqlmigrate` command takes migration names and returns their SQL:
es: Existe un comando que corre las migraciones y administra el esquema de base de datos automáticamente - se llama :djadmin:`migrate`, y llegaremos a él en un momento - pero primero, veamos cuál es el SQL que la migración correría. El comando :djadmin:`sqlmigrate` toma nombres de migraciones y devuelve el SQL respectivo:

source: You should see something similar to the following (we've reformatted it for readability):
es: Deberías ver algo similar a lo siguiente (reformateado aquí por legibilidad):

source: Note the following:
es: Notemos lo siguiente:

source: The exact output will vary depending on the database you are using. The example above is generated for PostgreSQL.
es: La salida exacta varía de acuerdo a la base de datos que se esté usando. El ejemplo anterior está generado para PostgreSQL.

source: Table names are automatically generated by combining the name of the app (``polls``) and the lowercase name of the model -- ``question`` and ``choice``. (You can override this behavior.)
es: Los nombres de las tablas se generan automáticamente combinando el nombre de la app (``polls``) con el nombre, en minúsculas del modelo -- ``question`` y ``choice`` (se puede modificar este comportamientos).

source: Primary keys (IDs) are added automatically. (You can override this, too.)
es: Las claves primarias (IDs) se agregan automáticamente (esto también se puede modificar).

source: By convention, Django appends ``"_id"`` to the foreign key field name. (Yes, you can override this, as well.)
es: Por convención, Django añade ``"_id"`` al nombre del campo de clave foránea (sí, se puede modificar esto también).

source: The foreign key relationship is made explicit by a ``FOREIGN KEY`` constraint. Don't worry about the ``DEFERRABLE`` parts; that's just telling PostgreSQL to not enforce the foreign key until the end of the transaction.
es: La relación de clave foránea se hace explícita mediante un constraint ``FOREIGN KEY``. No te preocupes por la parte del ``DEFERRABLE``; indica a PostgreSQL no forzar la clave foránea hasta el final de la transacción.

source: It's tailored to the database you're using, so database-specific field types such as ``auto_increment`` (MySQL), ``serial`` (PostgreSQL), or ``integer primary key autoincrement`` (SQLite) are handled for you automatically. Same goes for quoting of field names -- e.g., using double quotes or single quotes.
es: Se ajusta a la base de datos que se esté usando, y entonces los tipos de campos específicos de la base de datos como ``auto_increment`` (MySQL), ``serial`` (PostgreSQL), o ``integer primary key`` (SQLite) se manejan por uno automáticamente. Lo mismo aplica para los nombres de los campos -- e.g., el uso de comillas dobles o simples.

source: The :djadmin:`sqlmigrate` command doesn't actually run the migration on your database - it just prints it to the screen so that you can see what SQL Django thinks is required. It's useful for checking what Django is going to do or if you have database administrators who require SQL scripts for changes.
es: El comando :djadmin:`sqlmigrate` no corre la migración en la base de datos - solamente imprime por pantalla para mostrar cuál es el SQL que Django piensa es requerido. Es útil para chequear lo que Django va a hacer o si uno tiene administradores de base de datos que requieren el SQL para aplicar los cambios.
