Repository: igorrocha/django-tutorial
Catalog: locale/*/LC_MESSAGES/intro.po
Languages: es

source: When choosing a name for your package, check resources like PyPI to avoid naming conflicts with existing packages. It's often useful to prepend ``django-`` to your module name when creating a package to distribute. This helps others looking for Django apps identify your app as Django specific.
es: Cuando uno elige un nombre para un paquete es buena idea chequear fuentes como PyPI para evitar conflictos de nombre con paquetes existentes. A menudo es útil usar el prefijo ``django-`` para el nombre cuando uno crea un paquete para distruirlo. Esto ayuda a que aquellos que buscan apps de Django identifiquen la app como específica para Django.

source: Application labels (that is, the final part of the dotted path to application packages) *must* be unique in :setting:`INSTALLED_APPS`. Avoid using the same label as any of the Django `contrib packages <https://docs.djangoproject.com/en/1.8/ref/contrib/index>`_, for example ``auth``, ``admin``, or ``messages``.
es: El nombre de una aplicación (es decir, la parte final del path de importación) *debe* ser único en :setting:`INSTALLED_APPS`. Evitá usar el mismo nombre que cualquiera de los `paquetes contrib de Django <https://docs.djangoproject.com/en/1.8/ref/contrib/index>`_, como ``auth``, ``admin``, o ``messages``.

source: Move the ``polls`` directory into the ``django-polls`` directory.
es: Movemos el directorio ``polls`` dentro de ``django-polls``.

source: Create a file ``django-polls/README.rst`` with the following contents:
es: Creamos un archivo ``django-polls/README.rst`` con el siguiente contenido:

source: Create a ``django-polls/LICENSE`` file. Choosing a license is beyond the scope of this tutorial, but suffice it to say that code released publicly without a license is *useless*. Django and many Django-compatible apps are distributed under the BSD license; however, you're free to pick your own license. Just be aware that your licensing choice will affect who is able to use your code.
es: Creamos un archivo ``django-polls/LICENSE``. Elegir una licencia está más allá del alcance de este tutorial, pero vale decir que código liberado públicamente sin una licencia es *inútil*. Django y muchas aplicaciones Django se distribuyen bajo la licencia BSD; sin embargo, uno puede elegir su propia licencia, teniendo en cuenta que ésta afecta quién puede utilizar nuestro código.

source: Next we'll create a ``setup.py`` file which provides details about how to build and install the app. A full explanation of this file is beyond the scope of this tutorial, but the `setuptools docs <http://pythonhosted.org/setuptools/setuptools.html>`_ have a good explanation. Create a file ``django-polls/setup.py`` with the following contents:
es: Luego vamos a crear un archivo ``setup.py`` que provee los detalles sobre cómo construir e instalar la app. Escapa a este tutorial una explicación más detallada sobre este archivo, pero `la documentación de setuptools <http://pythonhosted.org/setuptools/setuptools.html>`_ tiene una buena explicación. Creamos el archivo ``django-polls/setup.py`` con el siguiente contenido:

source: Only Python modules and packages are included in the package by default. To include additional files, we'll need to create a ``MANIFEST.in`` file. The setuptools docs referred to in the previous step discuss this file in more details. To include the templates, the ``README.rst`` and our ``LICENSE`` file, create a file ``django-polls/MANIFEST.in`` with the following contents:
es: Solamente módulos y paquetes Python se incluyen por defecto en el paquete. Para incluir archivos adicionales, necesitamos crear un archivo ``MANIFEST.in``. La documentación sobre distribute referida en el paso anterior revisa este archivo en más detalle. Para incluir los templates y nuestro archivo LICENSE, creamos el archivo ``django-polls/MANIFEST.in`` con el siguiente contenido:

source: It's optional, but recommended, to include detailed documentation with your app. Create an empty directory ``django-polls/docs`` for future documentation. Add an additional line to ``django-polls/MANIFEST.in``::
es: Es opcional, pero se recomienda, incluir documentación detallada con una app. Creamos un directorio vacío ``django-polls/docs`` para la futura documentación. Agregamos una línea adicional al archivo ``django-polls/MANIFEST.in``::

source: Note that the ``docs`` directory won't be included in your package unless you add some files to it. Many Django apps also provide their documentation online through sites like `readthedocs.org <https://readthedocs.org>`_.
es: Notemos que el directorio ``docs`` no se va a incluir en nuestro paquete a menos que agreguemos algunos archivos dentro. Muchas apps Django también proveen su documentación de forma online mediante sitios como `readthedocs.org <https://readthedocs.org>`_.

source: Try building your package with ``python setup.py sdist`` (run from inside ``django-polls``). This creates a directory called ``dist`` and builds your new package, ``django-polls-0.1.tar.gz``.
es: Intentemos construir nuestro paquete con ``python setup.py sdist`` (corriendo desde dentro de ``django-polls``). Esto crea un directorio llamado ``dist`` y crea un nuevo paquete, ``django-polls-0.1.tar.gz``.

source: For more information on packaging, see Python's `Tutorial on Packaging and Distributing Projects <https://packaging.python.org/en/latest/distributing.html>`_.
es: Para más información sobre empaquetar, podés ver el `Tutorial sobre empaquetar y distribuir proyectos <https://packaging.python.org/en/latest/distributing.html>`_.

source: Using your own package
es: Usando nuestro paquete

source: Since we moved the ``polls`` directory out of the project, it's no longer working. We'll now fix this by installing our new ``django-polls`` package.
es: Como movimos el directorio ``polls`` fuera de nuestro proyecto, no funciona más. Vamos a solucionar esto instalando nuestro nuevo paquete, ``django-polls``.

source: Installing as a user library
es: Instalando como librería de usuario

source: The following steps install ``django-polls`` as a user library. Per-user installs have a lot of advantages over installing the package system-wide, such as being usable on systems where you don't have administrator access as well as preventing the package from affecting system services and other users of the machine.
es: Los siguientes pasos instalan ``django-polls`` como una librería de usuario. Las instalaciones por usuario tienen muchas ventajas sobre las instalaciones a nivel sistema, como por ejemplo permitir usar un paquete en sistemas donde no se tiene acceso de administrador o también prevenir que un paquete afecte servicios de sistema y/o otros usuarios en la máquina.

source: Note that per-user installations can still affect the behavior of system tools that run as that user, so ``virtualenv`` is a more robust solution (see below).
es: Notar que las instalaciones por usuario pueden incluso afectar herramientas del sistema que corren bajo ese usuario, entonces ``virtualenv`` es un solución más robusta (ver más abajo).

source: To install the package, use pip (you already `installed it <https://docs.djangoproject.com/en/1.8/topics/install/#installing-official-release>`_, right?)::
es: Para instalar el paquete usamos pip (ya lo `instalamos <https://docs.djangoproject.com/en/1.8/topics/install/#installing-official-release>`_, no?)::

source: With luck, your Django project should now work correctly again. Run the server again to confirm this.
es: Con suerte, nuestro proyecto Django debería funcionar correctamente de nuevo. Levantamos el servidor de desarrollo para confirmarlo.

source: To uninstall the package, use pip::
es: Para desinstalar el paquete, usamos pip::

source: Publishing your app
es: Publicando nuestra app

source: Now that we've packaged and tested ``django-polls``, it's ready to share with the world! If this wasn't just an example, you could now:
es: Ahora que ya empaquetamos y testeamos ``django-polls``, está lista para compartirla con el mundo! Si este no fuera sólo un ejemplo, uno podría:

source: Email the package to a friend.
es: Enviar el paquete vía email a un amigo.

source: Upload the package on your Web site.
es: Subir el paquete al sitio web propio.

source: Post the package on a public repository, such as `the Python Package Index (PyPI)`_. `packaging.python.org <https://packaging.python.org>`_ has `a good tutorial <https://packaging.python.org/en/latest/distributing.html#uploading-your-project-to-pypi>`_ for doing this.
es: Subir el paquete a un repositorio público, como ser `Python Package Index (PyPI)`_. `packaging.python.org <https://packaging.python.org>`_ tiene `un buen tutorial <https://packaging.python.org/en/latest/distributing.html#uploading-your-project-to-pypi>`_ para esto.

source: Installing Python packages with virtualenv
es: Instalando paquetes Python con virtualenv

source: Earlier, we installed the polls app as a user library. This has some disadvantages:
es: Instalar la app polls como librería de usuario tiene algunas desventajas:

source: Modifying the user libraries can affect other Python software on your system.
es: Modificar las librerías de usuario puede afectar otro software Python de nuestro sistema.

source: You won't be able to run multiple versions of this package (or others with the same name).
es: No podemos correr múltiples versiones de nuestro paquete (u otros con el mismo nombre).

source: Typically, these situations only arise once you're maintaining several Django projects. When they do, the best solution is to use `virtualenv <http://www.virtualenv.org/>`_. This tool allows you to maintain multiple isolated Python environments, each with its own copy of the libraries and package namespace.
es: Típicamente, estas situaciones sólo se presentan si uno mantiene varios proyectos Django. En ese caso, la mejor solución es usar `virtualenv <http://www.virtualenv.org/>`_. Esta herramienta permite mantener múltiples ambientes Python aislados, cada uno con su propia copia de librerías y paquetes.

source: Writing your first Django app, part 1
es: Escribiendo tu primera Django app, parte 1

source: Let's learn by example.
es: Vamos a aprender mediante un ejemplo.

source: Throughout this tutorial, we'll walk you through the creation of a basic poll application.
es: A lo largo de este tutorial vamos a recorrer la creación de una aplicación de encuestas básica.

source: It'll consist of two parts:
es: Consistirá de dos partes:

source: A public site that lets people view polls and vote in them.
es: Un sitio público que permite a la gente ver y votar encuestas.

source: An admin site that lets you add, change and delete polls.
es: Un sitio de administración que nos permite agregar, cambiar y borrar encuestas.

source: We'll assume you have :doc:`Django installed </intro/install>` already. You can tell Django is installed and which version by running the following command:
es: Vamos a asumir que tenés :doc:`Django ya instalado </intro/install>`. Podés chequear esto, así como también la versión, corriendo el siguiente comando:

source: If Django is installed, you should see the version of your installation. If it isn't, you'll get an error telling "No module named django".
es: Si Django está instalado, deberías ver la versión de tu instalación. Si no, obtendrás un error diciendo "No module named django".

source: This tutorial is written for Django |version| and Python 3.2 or later. If the Django version doesn't match, you can refer to the tutorial for your version of Django by using the version switcher at the bottom right corner of this page, or update Django to the newest version. If you are still using Python 2.7, you will need to adjust the code samples slightly, as described in comments.
es: Este tutorial está escrito para Django |version| y Python 3.2 o mayor. Si la versión de Django no coincide, te podés remitir a la versión del tutorial que corresponda, o actualizar Django a la versión más reciente. Si todavía usás Python 2.7, vas a necesitar ajustar los ejemplos ligeramente como se describe en los comentarios.s

source: See `How to install Django <https://docs.djangoproject.com/en/1.8/topics/install>`_ for advice on how to remove older versions of Django and install a newer one.
es: Ver `Cómo instalar Django <https://docs.djangoproject.com/en/1.8/topics/install>`_ para leer sobre cómo borrar versiones anteriores de Django e instalar una más reciente.

source: If you're having trouble going through this tutorial, please post a message to `django-users mailing list <http://groups.google.com/group/django-users/>`_ or drop by `#django on irc.freenode.net <irc://irc.freenode.net/django>`_ to chat with other Django users who might be able to help.
es: Si tenés problemas siguiendo este tutorial, por favor posteá un mensaje a `lista de correo django-users <http://groups.google.com/group/django-users/>`_ o date una vuelta por `#django en irc.freenode.net <irc://irc.freenode.net/django>`_ para chatear con otros usuarios de Django que quizás te puedan ayudar.

source: Creating a project
es: Creando un proyecto

source: If this is your first time using Django, you'll have to take care of some initial setup. Namely, you'll need to auto-generate some code that establishes a Django :term:`project` -- a collection of settings for an instance of Django, including database configuration, Django-specific options and application-specific settings.
es: Si esta es tu primera vez usando Django, tenés que hacer un setup inicial. En particular, necesitás auto-generar algo de código que define un Django :term:`project` -- una colección de settings para una instancia de Django, que incluye la configuración de la base de datos, opciones específicas de Django y settings específicos de las aplicaciones.

source: From the command line, ``cd`` into a directory where you'd like to store your code, then run the following command:
es: Desde la línea de comandos, ``cd`` al directorio donde quisieras guardar tu código, y corré el siguiente comando:

source: This will create a ``mysite`` directory in your current directory. If it didn't work, see `Problems running django-admin.py <https://docs.djangoproject.com/en/1.8/faq/troubleshooting/#troubleshooting-django-admin-py>`_.
es: Esto creará el directorio ``mysite`` en tu directorio actual. Si no funcionó, podés ver `Problemas corriendo django-admin.py <https://docs.djangoproject.com/en/1.8/faq/troubleshooting/#troubleshooting-django-admin-py>`_.

source: You'll need to avoid naming projects after built-in Python or Django components. In particular, this means you should avoid using names like ``django`` (which will conflict with Django itself) or ``test`` (which conflicts with a built-in Python package).
es: Hay que evitar nombrar los proyectos que coincidan con componentes built-in de Python o Django. En particular, significa que uno no debería usar nombres tales como ``django`` (en conflicto con Django mismo) o ``test`` (en conflicto con el paquete built-in ``test`` de Python).

source: Where should this code live?
es: Dónde debería estar este código?

source: If your background is in plain old PHP (with no use of modern frameworks), you're probably used to putting code under the Web server's document root (in a place such as ``/var/www``). With Django, you don't do that. It's not a good idea to put any of this Python code within your Web server's document root, because it risks the possibility that people may be able to view your code over the Web. That's not good for security.
es: Si tu background es en PHP (sin usar un framework moderno), probablemente estés acostumbrado a poner el código en la raíz del servidor web (un lugar como ``/var/www``). Con Django no se hace así. No es una buena idea poner código Python en dicho lugar, porque existe el riesgo de que la gente pueda ver tu código en la web. Eso no es bueno en relación a la seguridad.

source: Put your code in some directory **outside** of the document root, such as :file:`/home/mycode`.
es: Uno pone el código en algún directorio **fuera** de la raíz del servidor web, como :file:`/home/mycode`.

source: Let's look at what :djadmin:`startproject` created::
es: Veamos lo que creó :djadmin:`startproject`::

source: These files are:
es: Estos archivos son:

source: The outer :file:`mysite/` root directory is just a container for your project. Its name doesn't matter to Django; you can rename it to anything you like.
es: El directorio :file:`mysite/` de más afuera es sólo un contenedor para tu proyecto. El nombre no afecta a Django; lo podés renombrar libremente como quieras.

source: :file:`manage.py`: A command-line utility that lets you interact with this Django project in various ways. You can read all the details about :file:`manage.py` in `/ref/django-admin <https://docs.djangoproject.com/en/1.8/ref/django-admin>`_.
es: :file:`manage.py`: Una utilidad de línea de comandos que te permite interactuar con este proyecto Django de varias maneras. Podés leer todos los detalles sobre :file:`manage.py` en `/ref/django-admin <https://docs.djangoproject.com/en/1.8/ref/django-admin>`_.

source: The inner :file:`mysite/` directory is the actual Python package for your project. Its name is the Python package name you'll need to use to import anything inside it (e.g. ``mysite.urls``).
es: El directorio :file:`mysite/` interno es el paquete Python para tu proyecto. Su nombre es el nombre de paquete Python que necesitarás usar para importar cualquier cosa adentro del mismo (e.g. ``mysite.urls``).

source: :file:`mysite/__init__.py`: An empty file that tells Python that this directory should be considered a Python package. (Read `more about packages`_ in the official Python docs if you're a Python beginner.)
es: :file:`mysite/__init__.py`: Un archivo vacío que le dice a Python que este directorio debe considerarse un paquete Python (si sos nuevo con Python, podés `leer más sobre paquetes`_ en la documentación oficial de Python).

source: :file:`mysite/settings.py`: Settings/configuration for this Django project. `/topics/settings <https://docs.djangoproject.com/en/1.8/topics/settings>`_ will tell you all about how settings work.
es: :file:`mysite/settings.py`: Settings/configuración de este proyecto Django. `/topics/settings <https://docs.djangoproject.com/en/1.8/topics/settings>`_ describe cómo funcionan estos settings.

source: :file:`mysite/urls.py`: The URL declarations for this Django project; a "table of contents" of your Django-powered site. You can read more about URLs in `/topics/http/urls <https://docs.djangoproject.com/en/1.8/topics/http/urls>`_.
es: :file:`mysite/urls.py`: Declaración de las URL de este proyecto Django; una "tabla de contenidos" de tu sitio Django. Podés leer más sobre URLs en `/topics/http/urls <https://docs.djangoproject.com/en/1.8/topics/http/urls>`_.

source: :file:`mysite/wsgi.py`: An entry-point for WSGI-compatible web servers to serve your project. See `/howto/deployment/wsgi/index <https://docs.djangoproject.com/en/1.8/howto/deployment/wsgi/index>`_ for more details.
es: :file:`mysite/wsgi.py`: Punto de entrada para servir tu proyecto mediante servidores web compatibles con WSGI. Podés ver `/howto/deployment/wsgi/index <https://docs.djangoproject.com/en/1.8/howto/deployment/wsgi/index>`_ para más detalles.

source: Database setup
es: Configurar la base de datos

source: Now, edit :file:`mysite/settings.py`. It's a normal Python module with module-level variables representing Django settings.
es: Ahora editemos :file:`mysite/settings.py`. Es un módulo Python normal, que define variables a nivel módulo que representan los settings de Django.

source: By default, the configuration uses SQLite. If you're new to databases, or you're just interested in trying Django, this is the easiest choice. SQLite is included in Python, so you won't need to install anything else to support your database. When starting your first real project, however, you may want to use a more robust database like PostgreSQL, to avoid database-switching headaches down the road.
es: Por defecto, la configuración usa SQLite. Si sos nuevo en lo que a base de datos se refiere, o solamente te interesa probar Django, está es la opción más simple. SQLite está incluido en Python, entonces no es necesario instalar nada extra. Sin embargo, cuando empieces un proyecto más serio quizás quieras considerar una base de datos más robusta como PostgreSQL, para evitar dolores de cabeza cambiando el motor de base de datos durante el camino.

source: If you wish to use another database, install the appropriate `database bindings <https://docs.djangoproject.com/en/1.8/topics/install/#database-installation>`_, and change the following keys in the :setting:`DATABASES` ``'default'`` item to match your database connection settings:
es: Si querés usar otro motor de base de datos, instalá los `bindings apropiados <https://docs.djangoproject.com/en/1.8/topics/install/#database-installation>`_ y cambiá las siguientes claves en :setting:`DATABASES` ``'default'`` para que coincidan con la configuración de tu conexión a la base de datos:

source: :setting:`ENGINE <DATABASE-ENGINE>` -- Either ``'django.db.backends.sqlite3'``, ``'django.db.backends.postgresql_psycopg2'``, ``'django.db.backends.mysql'``, or ``'django.db.backends.oracle'``. Other backends are `also available <https://docs.djangoproject.com/en/1.8/ref/databases/#third-party-notes>`_.
es: :setting:`ENGINE <DATABASE-ENGINE>` -- Puede ser ``'django.db.backends.postgresql_psycopg2'``, ``'django.db.backends.mysql'``, ``'django.db.backends.sqlite3'`` o ``'django.db.backends.oracle'``. También hay :setting:`otros backends disponibles <https://docs.djangoproject.com/en/1.8/ref/databases/#third-party-notes>`_.

source: :setting:`NAME` -- The name of your database. If you're using SQLite, the database will be a file on your computer; in that case, :setting:`NAME` should be the full absolute path, including filename, of that file. The default value, ``os.path.join(BASE_DIR, 'db.sqlite3')``, will store the file in your project directory.
es: :setting:`NAME` -- El nombre de la base de datos. Si estás usando SQLite, tu base de datos será un archivo en tu computadora; en ese caso, :setting:`NAME` debería ser un path absoluto, incluyendo el nombre del archivo de base de datos. Si no existiera, se creará automáticamente cuando se sincronice la base de datos por primera vez.

source: If you are not using SQLite as your database, additional settings such as :setting:`USER`, :setting:`PASSWORD`, :setting:`HOST` must be added. For more details, see the reference documentation for :setting:`DATABASES`.
es: Si no estás usando SQLite, tenés que agregar parámetros adicionales como :setting:`USER`, :setting:`PASSWORD`, :setting:`HOST`. Para más detalles, ver la documentación de referencia para :setting:`DATABASES`.

source: If you're using PostgreSQL or MySQL, make sure you've created a database by this point. Do that with "``CREATE DATABASE database_name;``" within your database's interactive prompt.
es: Si usás PostgreSQL o MySQL, fijate de crear una base de datos antes de seguir. Para ello bastará con hacer \"``CREATE DATABASE database_name;``\" en el intérprete del motor correspondiente.

source: If you're using SQLite, you don't need to create anything beforehand - the database file will be created automatically when it is needed.
es: Si usás SQLite, no es necesario crear nada de antemano - el archivo de la base de datos se creará automáticamente cuando haga falta.

source: While you're editing :file:`mysite/settings.py`, set :setting:`TIME_ZONE` to your time zone.
es: Mientras editás :file:`settings.py`, podés setear :setting:`TIME_ZONE` a tu zona horaria.
